cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
/** @addtogroup ETH_Private_Defines
 * @{
 */
/* Delay to wait when writing to some Ethernet registers */
#define ETH_REG_WRITE_DELAY ((uint32_t) 0x00000001U)

/* Ethernet Errors */
#define ETH_SUCCESS ((uint32_t) 0U)
#define ETH_ERROR ((uint32_t) 1U)

/* Ethernet DMA Tx descriptors Collision Count Shift */
#define ETH_DMATXDESC_COLLISION_COUNTSHIFT ((uint32_t) 3U)

/* Ethernet DMA Tx descriptors Buffer2 Size Shift */
#define ETH_DMATXDESC_BUFFER2_SIZESHIFT ((uint32_t) 16U)

/* Ethernet DMA Rx descriptors Frame Length Shift */
#define ETH_DMARXDESC_FRAME_LENGTHSHIFT ((uint32_t) 16U)

/* Ethernet DMA Rx descriptors Buffer2 Size Shift */
#define ETH_DMARXDESC_BUFFER2_SIZESHIFT ((uint32_t) 16U)

/* Ethernet DMA Rx descriptors Frame length Shift */
#define ETH_DMARXDESC_FRAMELENGTHSHIFT ((uint32_t) 16U)

/* Ethernet MAC address offsets */
#define ETH_MAC_ADDR_HBASE  \
  (uint32_t)(ETH_MAC_BASE + \
             (uint32_t) 0x40U) /* Ethernet MAC address high offset */
#define ETH_MAC_ADDR_LBASE  \
  (uint32_t)(ETH_MAC_BASE + \
             (uint32_t) 0x44U) /* Ethernet MAC address low offset */

/* Ethernet MACMIIAR register Mask */
#define ETH_MACMIIAR_CR_MASK ((uint32_t) 0xFFFFFFE3U)

/* Ethernet MACCR register Mask */
#define ETH_MACCR_CLEAR_MASK ((uint32_t) 0xFF20810FU)

/* Ethernet MACFCR register Mask */
#define ETH_MACFCR_CLEAR_MASK ((uint32_t) 0x0000FF41U)

/* Ethernet DMAOMR register Mask */
#define ETH_DMAOMR_CLEAR_MASK ((uint32_t) 0xF8DE3F23U)

/* Ethernet Remote Wake-up frame register length */
#define ETH_WAKEUP_REGISTER_LENGTH 8U

/* Ethernet Missed frames counter Shift */
#define ETH_DMA_RX_OVERFLOW_MISSEDFRAMES_COUNTERSHIFT 17U

/**
 * @}
 */

#ifdef _lint
#ifdef __IO
#undef __IO
#endif
#define __IO

#ifdef ETH_TypeDef
#undef ETH_TypeDef
#endif
#define ETH_TypeDef void

#ifdef HAL_LockTypeDef
#undef HAL_LockTypeDef
#endif
#define HAL_LockTypeDef unsigned

#ifdef ETH_RX_BUF_SIZE
#undef ETH_RX_BUF_SIZE
#endif
#define ETH_RX_BUF_SIZE 1536

#ifdef ETH_TX_BUF_SIZE
#undef ETH_TX_BUF_SIZE
#endif
#define ETH_TX_BUF_SIZE 1536
#endif /* ifdef _lint */

/* Exported types ------------------------------------------------------------*/

/** @defgroup ETH_Exported_Types ETH Exported Types
 * @{
 */

/**
 * @brief  HAL State structures definition
 */
typedef enum {
  HAL_ETH_STATE_RESET =
      0x00U, /*!< Peripheral not yet Initialized or disabled         */
  HAL_ETH_STATE_READY = 0x01U, /*!< Peripheral Initialized and ready for use */
  HAL_ETH_STATE_BUSY = 0x02U,  /*!< an internal process is ongoing  */
  HAL_ETH_STATE_BUSY_TX = 0x12U, /*!< Data Transmission process is ongoing */
  HAL_ETH_STATE_BUSY_RX = 0x22U, /*!< Data Reception process is ongoing */
  HAL_ETH_STATE_BUSY_TX_RX =
      0x32U, /*!< Data Transmission and Reception process is ongoing */
  HAL_ETH_STATE_BUSY_WR = 0x42U, /*!< Write process is ongoing */
  HAL_ETH_STATE_BUSY_RD = 0x82U, /*!< Read process is ongoing */
  HAL_ETH_STATE_TIMEOUT = 0x03U, /*!< Timeout state */
  HAL_ETH_STATE_ERROR = 0x04U    /*!< Reception process is ongoing    */
} HAL_ETH_StateTypeDef;

/**
 * @brief  ETH Init Structure definition
 */

typedef struct {
  uint32_t AutoNegotiation; /*!< Selects or not the AutoNegotiation mode for the
                             * external PHY The AutoNegotiation allows an
                             * automatic setting of the Speed (10/100Mbps) and
                             * the mode (half/full-duplex). This parameter can
                             * be a value of @ref ETH_AutoNegotiation */

  uint32_t Speed; /*!< Sets the Ethernet speed: 10/100 Mbps.
                   *       This parameter can be a value of @ref ETH_Speed */

  uint32_t DuplexMode; /*!< Selects the MAC duplex mode: Half-Duplex or
                        * Full-Duplex mode This parameter can be a value of @ref
                        * ETH_Duplex_Mode */

  uint16_t PhyAddress; /*!< Ethernet PHY address.
                        *       This parameter must be a number between Min_Data
                        * = 0 and Max_Data = 32 */

  uint8_t *MACAddr; /*!< MAC Address of used Hardware: must be pointer on an
                       array of 6 bytes */

  uint32_t RxMode; /*!< Selects the Ethernet Rx mode: Polling mode, Interrupt
                    * mode. This parameter can be a value of @ref ETH_Rx_Mode */

  uint32_t ChecksumMode; /*!< Selects if the checksum is check by hardware or by
                          * software. This parameter can be a value of @ref
                          * ETH_Checksum_Mode */

  uint32_t
      MediaInterface; /*!< Selects the media-independent interface or the
                       * reduced media-independent interface. This parameter can
                       * be a value of @ref ETH_Media_Interface */
} ETH_InitTypeDef;

/**
 * @brief  ETH MAC Configuration Structure definition
 */

typedef struct {
  uint32_t
      Watchdog; /*!< Selects or not the Watchdog timer
                 *       When enabled, the MAC allows no more then 2048 bytes to
                 * be received. When disabled, the MAC can receive up to 16384
                 * bytes. This parameter can be a value of @ref ETH_Watchdog */

  uint32_t Jabber; /*!< Selects or not Jabber timer
                    *       When enabled, the MAC allows no more then 2048 bytes
                    * to be sent. When disabled, the MAC can send up to 16384
                    * bytes. This parameter can be a value of @ref ETH_Jabber */

  uint32_t InterFrameGap; /*!< Selects the minimum IFG between frames during
                           * transmission. This parameter can be a value of @ref
                           * ETH_Inter_Frame_Gap */

  uint32_t CarrierSense; /*!< Selects or not the Carrier Sense.
                          *       This parameter can be a value of @ref
                          * ETH_Carrier_Sense */

