cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
  uint32_t ReceiveOwn; /*!< Selects or not the ReceiveOwn,
                        *       ReceiveOwn allows the reception of frames when
                        * the TX_EN signal is asserted in Half-Duplex mode. This
                        * parameter can be a value of @ref ETH_Receive_Own */

  uint32_t LoopbackMode; /*!< Selects or not the internal MAC MII Loopback mode.
                          *       This parameter can be a value of @ref
                          * ETH_Loop_Back_Mode */

  uint32_t ChecksumOffload; /*!< Selects or not the IPv4 checksum checking for
                             * received frame payloads' TCP/UDP/ICMP headers.
                             *       This parameter can be a value of @ref
                             * ETH_Checksum_Offload */

  uint32_t
      RetryTransmission; /*!< Selects or not the MAC attempt retries
                          * transmission, based on the settings of BL, when a
                          * collision occurs (Half-Duplex mode). This parameter
                          * can be a value of @ref ETH_Retry_Transmission */

  uint32_t AutomaticPadCRCStrip; /*!< Selects or not the Automatic MAC Pad/CRC
                                  * Stripping. This parameter can be a value of
                                  * @ref ETH_Automatic_Pad_CRC_Strip */

  uint32_t BackOffLimit; /*!< Selects the BackOff limit value.
                          *       This parameter can be a value of @ref
                          * ETH_Back_Off_Limit */

  uint32_t DeferralCheck; /*!< Selects or not the deferral check function
                           * (Half-Duplex mode). This parameter can be a value
                           * of @ref ETH_Deferral_Check */

  uint32_t ReceiveAll; /*!< Selects or not all frames reception by the MAC (No
                        * filtering). This parameter can be a value of @ref
                        * ETH_Receive_All */

  uint32_t SourceAddrFilter; /*!< Selects the Source Address Filter mode.
                              *       This parameter can be a value of @ref
                              * ETH_Source_Addr_Filter */

  uint32_t PassControlFrames; /*!< Sets the forwarding mode of the control
                               * frames (including unicast and multicast PAUSE
                               * frames) This parameter can be a value of @ref
                               * ETH_Pass_Control_Frames */

  uint32_t
      BroadcastFramesReception; /*!< Selects or not the reception of Broadcast
                                 * Frames. This parameter can be a value of @ref
                                 * ETH_Broadcast_Frames_Reception */

  uint32_t DestinationAddrFilter; /*!< Sets the destination filter mode for both
                                   * unicast and multicast frames. This
                                   * parameter can be a value of @ref
                                   * ETH_Destination_Addr_Filter */

  uint32_t PromiscuousMode; /*!< Selects or not the Promiscuous Mode
                             *       This parameter can be a value of @ref
                             * ETH_Promiscuous_Mode */

  uint32_t
      MulticastFramesFilter; /*!< Selects the Multicast Frames filter mode:
                              * None/HashTableFilter/PerfectFilter/PerfectHashTableFilter.
                              *       This parameter can be a value of @ref
                              * ETH_Multicast_Frames_Filter */

  uint32_t
      UnicastFramesFilter; /*!< Selects the Unicast Frames filter mode:
                            * HashTableFilter/PerfectFilter/PerfectHashTableFilter.
                            *       This parameter can be a value of @ref
                            * ETH_Unicast_Frames_Filter */

  uint32_t HashTableHigh; /*!< This field holds the higher 32 bits of Hash
                           * table. This parameter must be a number between
                           * Min_Data = 0x0 and Max_Data = 0xFFFFFFFF */

  uint32_t HashTableLow; /*!< This field holds the lower 32 bits of Hash table.
                          *       This parameter must be a number between
                          * Min_Data = 0x0 and Max_Data = 0xFFFFFFFF  */

  uint32_t
      PauseTime; /*!< This field holds the value to be used in the Pause Time
                  * field in the transmit control frame. This parameter must be
                  * a number between Min_Data = 0x0 and Max_Data = 0xFFFF */

  uint32_t ZeroQuantaPause; /*!< Selects or not the automatic generation of
                             * Zero-Quanta Pause Control frames. This parameter
                             * can be a value of @ref ETH_Zero_Quanta_Pause */

  uint32_t
      PauseLowThreshold; /*!< This field configures the threshold of the PAUSE
                          * to be checked for automatic retransmission of PAUSE
                          * Frame. This parameter can be a value of @ref
                          * ETH_Pause_Low_Threshold */

  uint32_t UnicastPauseFrameDetect; /*!< Selects or not the MAC detection of the
                                     * Pause frames (with MAC Address0 unicast
                                     * address and unique multicast address).
                                     *       This parameter can be a value of
                                     * @ref ETH_Unicast_Pause_Frame_Detect */

  uint32_t
      ReceiveFlowControl; /*!< Enables or disables the MAC to decode the
                           * received Pause frame and disable its transmitter
                           * for a specified time (Pause Time) This parameter
                           * can be a value of @ref ETH_Receive_Flow_Control */

  uint32_t
      TransmitFlowControl; /*!< Enables or disables the MAC to transmit Pause
                            * frames (Full-Duplex mode) or the MAC back-pressure
                            * operation (Half-Duplex mode) This parameter can be
                            * a value of @ref ETH_Transmit_Flow_Control */

  uint32_t VLANTagComparison; /*!< Selects the 12-bit VLAN identifier or the
                               * complete 16-bit VLAN tag for comparison and
                               * filtering. This parameter can be a value of
                               * @ref ETH_VLAN_Tag_Comparison */

