cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
  uint32_t VLANTagIdentifier; /*!< Holds the VLAN tag identifier for receive
                                 frames */
} ETH_MACInitTypeDef;

/**
 * @brief  ETH DMA Configuration Structure definition
 */

typedef struct {
  uint32_t
      DropTCPIPChecksumErrorFrame; /*!< Selects or not the Dropping of TCP/IP
                                    * Checksum Error Frames. This parameter can
                                    * be a value of @ref
                                    * ETH_Drop_TCP_IP_Checksum_Error_Frame */

  uint32_t ReceiveStoreForward; /*!< Enables or disables the Receive store and
                                 * forward mode. This parameter can be a value
                                 * of @ref ETH_Receive_Store_Forward */

  uint32_t FlushReceivedFrame; /*!< Enables or disables the flushing of received
                                * frames. This parameter can be a value of @ref
                                * ETH_Flush_Received_Frame */

  uint32_t TransmitStoreForward; /*!< Enables or disables Transmit store and
                                  * forward mode. This parameter can be a value
                                  * of @ref ETH_Transmit_Store_Forward */

  uint32_t
      TransmitThresholdControl; /*!< Selects or not the Transmit Threshold
                                 * Control. This parameter can be a value of
                                 * @ref ETH_Transmit_Threshold_Control */

  uint32_t ForwardErrorFrames; /*!< Selects or not the forward to the DMA of
                                * erroneous frames. This parameter can be a
                                * value of @ref ETH_Forward_Error_Frames */

  uint32_t ForwardUndersizedGoodFrames; /*!< Enables or disables the Rx FIFO to
                                         * forward Undersized frames (frames
                                         * with no Error and length less than 64
                                         * bytes) including pad-bytes and CRC)
                                         * This parameter can be a value of @ref
                                         * ETH_Forward_Undersized_Good_Frames */

  uint32_t
      ReceiveThresholdControl; /*!< Selects the threshold level of the Receive
                                * FIFO. This parameter can be a value of @ref
                                * ETH_Receive_Threshold_Control */

  uint32_t
      SecondFrameOperate; /*!< Selects or not the Operate on second frame mode,
                           * which allows the DMA to process a second frame of
                           * Transmit data even before obtaining the status for
                           * the first frame. This parameter can be a value of
                           * @ref ETH_Second_Frame_Operate */

  uint32_t AddressAlignedBeats; /*!< Enables or disables the Address Aligned
                                 * Beats. This parameter can be a value of @ref
                                 * ETH_Address_Aligned_Beats */

  uint32_t FixedBurst; /*!< Enables or disables the AHB Master interface fixed
                        * burst transfers. This parameter can be a value of @ref
                        * ETH_Fixed_Burst */

  uint32_t
      RxDMABurstLength; /*!< Indicates the maximum number of beats to be
                         * transferred in one Rx DMA transaction. This parameter
                         * can be a value of @ref ETH_Rx_DMA_Burst_Length */

  uint32_t
      TxDMABurstLength; /*!< Indicates the maximum number of beats to be
                         * transferred in one Tx DMA transaction. This parameter
                         * can be a value of @ref ETH_Tx_DMA_Burst_Length */

  uint32_t
      EnhancedDescriptorFormat; /*!< Enables the enhanced descriptor format.
                                 *       This parameter can be a value of @ref
                                 * ETH_DMA_Enhanced_descriptor_format */

  uint32_t DescriptorSkipLength; /*!< Specifies the number of word to skip
                                  * between two unchained descriptors (Ring
                                  * mode) This parameter must be a number
                                  * between Min_Data = 0 and Max_Data = 32 */

  uint32_t DMAArbitration; /*!< Selects the DMA Tx/Rx arbitration.
                            *       This parameter can be a value of @ref
                            * ETH_DMA_Arbitration */
} ETH_DMAInitTypeDef;

/**
 * @brief  ETH DMA Descriptors data structure definition
 */

typedef struct {
  __IO uint32_t Status; /*!< Status */

  uint32_t ControlBufferSize; /*!< Control and Buffer1, Buffer2 lengths */

  uint32_t Buffer1Addr; /*!< Buffer1 address pointer */

  uint32_t
      Buffer2NextDescAddr; /*!< Buffer2 or next descriptor address pointer */

  /*!< Enhanced Ethernet DMA PTP Descriptors */
  uint32_t ExtendedStatus; /*!< Extended status for PTP receive descriptor */

  uint32_t Reserved1; /*!< Reserved */

  uint32_t TimeStampLow; /*!< Time Stamp Low value for transmit and receive */

  uint32_t TimeStampHigh; /*!< Time Stamp High value for transmit and receive */
} ETH_DMADescTypeDef;

/**
 * @brief  Received Frame Informations structure definition
 */
typedef struct {
  ETH_DMADescTypeDef *FSRxDesc; /*!< First Segment Rx Desc */

  ETH_DMADescTypeDef *LSRxDesc; /*!< Last Segment Rx Desc */

  uint32_t SegCount; /*!< Segment count */

  uint32_t length; /*!< Frame length */

  uint32_t buffer; /*!< Frame buffer */
} ETH_DMARxFrameInfos;

/**
 * @brief  ETH Handle Structure definition
 */

typedef struct {
  ETH_TypeDef *Instance; /*!< Register base address       */

  ETH_InitTypeDef Init; /*!< Ethernet Init Configuration */

  uint32_t LinkStatus; /*!< Ethernet link status        */

  ETH_DMADescTypeDef *RxDesc; /*!< Rx descriptor to Get        */

  ETH_DMADescTypeDef *TxDesc; /*!< Tx descriptor to Set        */

  ETH_DMARxFrameInfos RxFrameInfos; /*!< last Rx frame infos         */

  __IO HAL_ETH_StateTypeDef State; /*!< ETH communication state     */

