cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
  HAL_LockTypeDef Lock; /*!< ETH Lock                    */
} ETH_HandleTypeDef;

/**
 * @}
 */

/* Exported constants --------------------------------------------------------*/

/** @defgroup ETH_Exported_Constants ETH Exported Constants
 * @{
 */

/** @defgroup ETH_Buffers_setting ETH Buffers setting
 * @{
 */
#define ETH_MAX_PACKET_SIZE                                       \
  ((uint32_t) 1536U) /*!< ETH_HEADER + ETH_EXTRA + ETH_VLAN_TAG + \
                        ETH_MAX_ETH_PAYLOAD + ETH_CRC */
#define ETH_HEADER                                                            \
  ((uint32_t) 14U) /*!< 6 byte Dest addr, 6 byte Src addr, 2 byte length/type \
                    */
#define ETH_CRC ((uint32_t) 4U)      /*!< Ethernet CRC */
#define ETH_EXTRA ((uint32_t) 2U)    /*!< Extra bytes in some cases */
#define ETH_VLAN_TAG ((uint32_t) 4U) /*!< optional 802.1q VLAN Tag */
#define ETH_MIN_ETH_PAYLOAD \
  ((uint32_t) 46U) /*!< Minimum Ethernet payload size */
#define ETH_MAX_ETH_PAYLOAD \
  ((uint32_t) 1500U) /*!< Maximum Ethernet payload size */
#define ETH_JUMBO_FRAME_PAYLOAD \
  ((uint32_t) 9000U) /*!< Jumbo frame payload size */

/* Ethernet driver receive buffers are organized in a chained linked-list, when
 * an Ethernet packet is received, the Rx-DMA will transfer the packet from
 * RxFIFO to the driver receive buffers memory.
 *
 * Depending on the size of the received Ethernet packet and the size of
 * each Ethernet driver receive buffer, the received packet can take one or more
 * Ethernet driver receive buffer.
 *
 * In below are defined the size of one Ethernet driver receive buffer
 * ETH_RX_BUF_SIZE and the total count of the driver receive buffers
 * ETH_RXBUFNB.
 *
 * The configured value for ETH_RX_BUF_SIZE and ETH_RXBUFNB are only provided as
 * example, they can be reconfigured in the application layer to fit the
 * application needs */

/* Here we configure each Ethernet driver receive buffer to fit the Max size
 * Ethernet packet */
#ifndef ETH_RX_BUF_SIZE
#error please define ETH_RX_BUF_SIZE
#define ETH_RX_BUF_SIZE ETH_MAX_PACKET_SIZE
#endif

/* 5 Ethernet driver receive buffers are used (in a chained linked list)*/
#ifndef ETH_RXBUFNB
#define ETH_RXBUFNB                                        \
  ((uint32_t) 5U) /*  5 Rx buffers of size ETH_RX_BUF_SIZE \
                   */
#endif

/* Ethernet driver transmit buffers are organized in a chained linked-list, when
 * an Ethernet packet is transmitted, Tx-DMA will transfer the packet from the
 * driver transmit buffers memory to the TxFIFO.
 *
 * Depending on the size of the Ethernet packet to be transmitted and the size
 * of each Ethernet driver transmit buffer, the packet to be transmitted can
 * take one or more Ethernet driver transmit buffer.
 *
 * In below are defined the size of one Ethernet driver transmit buffer
 * ETH_TX_BUF_SIZE and the total count of the driver transmit buffers
 * ETH_TXBUFNB.
 *
 * The configured value for ETH_TX_BUF_SIZE and ETH_TXBUFNB are only provided as
 * example, they can be reconfigured in the application layer to fit the
 * application needs */

/* Here we configure each Ethernet driver transmit buffer to fit the Max size
 * Ethernet packet */
#ifndef ETH_TX_BUF_SIZE
#error please define ETH_TX_BUF_SIZE
#define ETH_TX_BUF_SIZE ETH_MAX_PACKET_SIZE
#endif

/* 5 Ethernet driver transmit buffers are used (in a chained linked list)*/
#ifndef ETH_TXBUFNB
#define ETH_TXBUFNB                                        \
  ((uint32_t) 5U) /* 5  Tx buffers of size ETH_TX_BUF_SIZE \
                   */
#endif

/**
 * @}
 */

/** @defgroup ETH_DMA_TX_Descriptor ETH DMA TX Descriptor
 * @{
 */

/*
 * DMA Tx Descriptor
 * -----------------------------------------------------------------------------------------------
 * TDES0 | OWN(31) | CTRL[30:26] | Reserved[25:24] | CTRL[23:20] |
 * Reserved[19:17] | Status[16:0] |
 * -----------------------------------------------------------------------------------------------
 * TDES1 | Reserved[31:29] | Buffer2 ByteCount[28:16] | Reserved[15:13] |
 * Buffer1 ByteCount[12:0] |
 * -----------------------------------------------------------------------------------------------
 * TDES2 |                         Buffer1 Address [31:0] |
 * -----------------------------------------------------------------------------------------------
 * TDES3 |                   Buffer2 Address [31:0] / Next Descriptor Address
 * [31:0]              |
 * -----------------------------------------------------------------------------------------------
 */

/**
 * @brief  Bit definition of TDES0 register: DMA Tx descriptor status register
 */
#define ETH_DMATXDESC_OWN \
  ((uint32_t) 0x80000000U) /*!< OWN bit: descriptor is owned by DMA engine */
#define ETH_DMATXDESC_IC \
  ((uint32_t) 0x40000000U) /*!< Interrupt on Completion */
#define ETH_DMATXDESC_LS ((uint32_t) 0x20000000U) /*!< Last Segment */
#define ETH_DMATXDESC_FS ((uint32_t) 0x10000000U) /*!< First Segment */
#define ETH_DMATXDESC_DC ((uint32_t) 0x08000000U) /*!< Disable CRC */
#define ETH_DMATXDESC_DP ((uint32_t) 0x04000000U) /*!< Disable Padding */
#define ETH_DMATXDESC_TTSE \
  ((uint32_t) 0x02000000U) /*!< Transmit Time Stamp Enable */
#define ETH_DMATXDESC_CIC \
  ((uint32_t) 0x00C00000U) /*!< Checksum Insertion Control: 4 cases */
#define ETH_DMATXDESC_CIC_BYPASS \
  ((uint32_t) 0x00000000U) /*!< Do Nothing: Checksum Engine is bypassed */
#define ETH_DMATXDESC_CIC_IPV4HEADER \
  ((uint32_t) 0x00400000U) /*!< IPV4 header Checksum Insertion */
#define ETH_DMATXDESC_CIC_TCPUDPICMP_SEGMENT                               \
  ((uint32_t) 0x00800000U) /*!< TCP/UDP/ICMP Checksum Insertion calculated \
                              over segment only */
#define ETH_DMATXDESC_CIC_TCPUDPICMP_FULL                             \
  ((uint32_t) 0x00C00000U) /*!< TCP/UDP/ICMP Checksum Insertion fully \
                              calculated */
#define ETH_DMATXDESC_TER                            \
  ((uint32_t) 0x00200000U) /*!< Transmit End of Ring \
                            */
#define ETH_DMATXDESC_TCH \
  ((uint32_t) 0x00100000U) /*!< Second Address Chained */
#define ETH_DMATXDESC_TTSS                                                   \
  ((uint32_t) 0x00020000U)                         /*!< Tx Time Stamp Status \
                                                    */
#define ETH_DMATXDESC_IHE ((uint32_t) 0x00010000U) /*!< IP Header Error */
#define ETH_DMATXDESC_ES                                                       \
  ((uint32_t) 0x00008000U) /*!< Error summary: OR of the following bits: UE || \
                              ED || EC || LCO || NC || LCA || FF || JT */
#define ETH_DMATXDESC_JT ((uint32_t) 0x00004000U) /*!< Jabber Timeout */
#define ETH_DMATXDESC_FF                                                     \
  ((uint32_t) 0x00002000U) /*!< Frame Flushed: DMA/MTL flushed the frame due \
                              to SW flush */
#define ETH_DMATXDESC_PCE \
  ((uint32_t) 0x00001000U) /*!< Payload Checksum Error */
#define ETH_DMATXDESC_LCA                                            \
  ((uint32_t) 0x00000800U) /*!< Loss of Carrier: carrier lost during \
                              transmission */
#define ETH_DMATXDESC_NC                                               \
  ((uint32_t) 0x00000400U) /*!< No Carrier: no carrier signal from the \
                              transceiver */
#define ETH_DMATXDESC_LCO                                                   \
  ((uint32_t) 0x00000200U) /*!< Late Collision: transmission aborted due to \
                              collision */
#define ETH_DMATXDESC_EC                                                  \
  ((uint32_t) 0x00000100U) /*!< Excessive Collision: transmission aborted \
                              after 16 collisions */
#define ETH_DMATXDESC_VF ((uint32_t) 0x00000080U) /*!< VLAN Frame */
#define ETH_DMATXDESC_CC ((uint32_t) 0x00000078U) /*!< Collision Count */
#define ETH_DMATXDESC_ED ((uint32_t) 0x00000004U) /*!< Excessive Deferral */
#define ETH_DMATXDESC_UF                                                    \
  ((uint32_t) 0x00000002U) /*!< Underflow Error: late data arrival from the \
                              memory */
#define ETH_DMATXDESC_DB ((uint32_t) 0x00000001U) /*!< Deferred Bit */

/**
 * @brief  Bit definition of TDES1 register
 */
#define ETH_DMATXDESC_TBS2 \
  ((uint32_t) 0x1FFF0000U) /*!< Transmit Buffer2 Size */
#define ETH_DMATXDESC_TBS1 \
  ((uint32_t) 0x00001FFFU) /*!< Transmit Buffer1 Size */

/**
 * @brief  Bit definition of TDES2 register
 */
#define ETH_DMATXDESC_B1AP \
  ((uint32_t) 0xFFFFFFFFU) /*!< Buffer1 Address Pointer */

/**
 * @brief  Bit definition of TDES3 register
 */
#define ETH_DMATXDESC_B2AP \
  ((uint32_t) 0xFFFFFFFFU) /*!< Buffer2 Address Pointer */

/*---------------------------------------------------------------------------------------------
 * TDES6 |                         Transmit Time Stamp Low [31:0] |
 * -----------------------------------------------------------------------------------------------
 * TDES7 |                         Transmit Time Stamp High [31:0] |
 * ----------------------------------------------------------------------------------------------*/

/* Bit definition of TDES6 register */
#define ETH_DMAPTPTXDESC_TTSL \
  ((uint32_t) 0xFFFFFFFFU) /* Transmit Time Stamp Low */

/* Bit definition of TDES7 register */
#define ETH_DMAPTPTXDESC_TTSH \
  ((uint32_t) 0xFFFFFFFFU) /* Transmit Time Stamp High */

/**
 * @}
 */

/** @defgroup ETH_DMA_RX_Descriptor ETH DMA RX Descriptor
 * @{
 */

