cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
/*
 * DMA Rx Descriptor
 * --------------------------------------------------------------------------------------------------------------------
 * RDES0 | OWN(31) |                                             Status [30:0] |
 * ---------------------------------------------------------------------------------------------------------------------
 * RDES1 | CTRL(31) | Reserved[30:29] | Buffer2 ByteCount[28:16] | CTRL[15:14] |
 * Reserved(13) | Buffer1 ByteCount[12:0] |
 * ---------------------------------------------------------------------------------------------------------------------
 * RDES2 |                                       Buffer1 Address [31:0] |
 * ---------------------------------------------------------------------------------------------------------------------
 * RDES3 |                          Buffer2 Address [31:0] / Next Descriptor
 * Address [31:0]                             |
 * ---------------------------------------------------------------------------------------------------------------------
 */

/**
 * @brief  Bit definition of RDES0 register: DMA Rx descriptor status register
 */
#define ETH_DMARXDESC_OWN \
  ((uint32_t) 0x80000000U) /*!< OWN bit: descriptor is owned by DMA engine  */
#define ETH_DMARXDESC_AFM \
  ((uint32_t) 0x40000000U) /*!< DA Filter Fail for the rx frame  */
#define ETH_DMARXDESC_FL \
  ((uint32_t) 0x3FFF0000U) /*!< Receive descriptor frame length  */
#define ETH_DMARXDESC_ES                                                       \
  ((uint32_t) 0x00008000U) /*!< Error summary: OR of the following bits: DE || \
                              OE || IPC || LC || RWT || RE || CE */
#define ETH_DMARXDESC_DE                                                  \
  ((uint32_t) 0x00004000U) /*!< Descriptor error: no more descriptors for \
                              receive frame  */
#define ETH_DMARXDESC_SAF \
  ((uint32_t) 0x00002000U) /*!< SA Filter Fail for the received frame */
#define ETH_DMARXDESC_LE \
  ((uint32_t) 0x00001000U) /*!< Frame size not matching with length field */
#define ETH_DMARXDESC_OE                                                 \
  ((uint32_t) 0x00000800U) /*!< Overflow Error: Frame was damaged due to \
                              buffer overflow */
#define ETH_DMARXDESC_VLAN \
  ((uint32_t) 0x00000400U) /*!< VLAN Tag: received frame is a VLAN frame */
#define ETH_DMARXDESC_FS \
  ((uint32_t) 0x00000200U) /*!< First descriptor of the frame  */
#define ETH_DMARXDESC_LS \
  ((uint32_t) 0x00000100U) /*!< Last descriptor of the frame  */
#define ETH_DMARXDESC_IPV4HCE                                               \
  ((uint32_t) 0x00000080U) /*!< IPC Checksum Error: Rx Ipv4 header checksum \
                              error   */
#define ETH_DMARXDESC_LC \
  ((uint32_t) 0x00000040U) /*!< Late collision occurred during reception   */
#define ETH_DMARXDESC_FT \
  ((uint32_t) 0x00000020U) /*!< Frame type - Ethernet, otherwise 802.3    */
#define ETH_DMARXDESC_RWT                                                \
  ((uint32_t) 0x00000010U) /*!< Receive Watchdog Timeout: watchdog timer \
                              expired during reception    */
#define ETH_DMARXDESC_RE                                                       \
  ((uint32_t) 0x00000008U) /*!< Receive error: error reported by MII interface \
                            */
#define ETH_DMARXDESC_DBE                                                 \
  ((uint32_t) 0x00000004U) /*!< Dribble bit error: frame contains non int \
                              multiple of 8 bits  */
#define ETH_DMARXDESC_CE ((uint32_t) 0x00000002U) /*!< CRC error */
#define ETH_DMARXDESC_MAMPCE                                                  \
  ((uint32_t) 0x00000001U) /*!< Rx MAC Address/Payload Checksum Error: Rx MAC \
                              address matched/ Rx Payload Checksum Error */

/**
 * @brief  Bit definition of RDES1 register
 */
#define ETH_DMARXDESC_DIC \
  ((uint32_t) 0x80000000U) /*!< Disable Interrupt on Completion */
#define ETH_DMARXDESC_RBS2                                                   \
  ((uint32_t) 0x1FFF0000U)                         /*!< Receive Buffer2 Size \
                                                    */
#define ETH_DMARXDESC_RER ((uint32_t) 0x00008000U) /*!< Receive End of Ring */
#define ETH_DMARXDESC_RCH \
  ((uint32_t) 0x00004000U) /*!< Second Address Chained */
#define ETH_DMARXDESC_RBS1                           \
  ((uint32_t) 0x00001FFFU) /*!< Receive Buffer1 Size \
                            */

/**
 * @brief  Bit definition of RDES2 register
 */
#define ETH_DMARXDESC_B1AP \
  ((uint32_t) 0xFFFFFFFFU) /*!< Buffer1 Address Pointer */

/**
 * @brief  Bit definition of RDES3 register
 */
#define ETH_DMARXDESC_B2AP \
  ((uint32_t) 0xFFFFFFFFU) /*!< Buffer2 Address Pointer */

/*---------------------------------------------------------------------------------------------------------------------
 * RDES4 |                   Reserved[31:15]              |             Extended
 * Status [14:0]                          |
 * ---------------------------------------------------------------------------------------------------------------------
 * RDES5 |                                            Reserved[31:0] |
 * ---------------------------------------------------------------------------------------------------------------------
 * RDES6 |                                       Receive Time Stamp Low [31:0] |
 * ---------------------------------------------------------------------------------------------------------------------
 * RDES7 |                                       Receive Time Stamp High [31:0]
 * |
 * --------------------------------------------------------------------------------------------------------------------*/

/* Bit definition of RDES4 register */
#define ETH_DMAPTPRXDESC_PTPV ((uint32_t) 0x00002000U)  /* PTP Version */
#define ETH_DMAPTPRXDESC_PTPFT ((uint32_t) 0x00001000U) /* PTP Frame Type */
#define ETH_DMAPTPRXDESC_PTPMT ((uint32_t) 0x00000F00U) /* PTP Message Type */
#define ETH_DMAPTPRXDESC_PTPMT_SYNC \
  ((uint32_t) 0x00000100U) /* SYNC message (all clock types) */
#define ETH_DMAPTPRXDESC_PTPMT_FOLLOWUP \
  ((uint32_t) 0x00000200U) /* FollowUp message (all clock types) */
#define ETH_DMAPTPRXDESC_PTPMT_DELAYREQ \
  ((uint32_t) 0x00000300U) /* DelayReq message (all clock types) */
#define ETH_DMAPTPRXDESC_PTPMT_DELAYRESP \
  ((uint32_t) 0x00000400U) /* DelayResp message (all clock types) */
#define ETH_DMAPTPRXDESC_PTPMT_PDELAYREQ_ANNOUNCE                              \
  ((uint32_t) 0x00000500U) /* PdelayReq message (peer-to-peer transparent      \
                              clock) or Announce message (Ordinary or Boundary \
                              clock) */
#define ETH_DMAPTPRXDESC_PTPMT_PDELAYRESP_MANAG                            \
  ((uint32_t) 0x00000600U) /* PdelayResp message (peer-to-peer transparent \
                              clock) or Management message (Ordinary or    \
                              Boundary clock)  */
#define ETH_DMAPTPRXDESC_PTPMT_PDELAYRESPFOLLOWUP_SIGNAL               \
  ((uint32_t) 0x00000700U) /* PdelayRespFollowUp message (peer-to-peer \
                              transparent clock) or Signaling message  \
                              (Ordinary or Boundary clock) */
#define ETH_DMAPTPRXDESC_IPV6PR \
  ((uint32_t) 0x00000080U) /* IPv6 Packet Received */
#define ETH_DMAPTPRXDESC_IPV4PR \
  ((uint32_t) 0x00000040U) /* IPv4 Packet Received */
#define ETH_DMAPTPRXDESC_IPCB \
  ((uint32_t) 0x00000020U) /* IP Checksum Bypassed */
#define ETH_DMAPTPRXDESC_IPPE ((uint32_t) 0x00000010U) /* IP Payload Error */
#define ETH_DMAPTPRXDESC_IPHE ((uint32_t) 0x00000008U) /* IP Header Error */
#define ETH_DMAPTPRXDESC_IPPT ((uint32_t) 0x00000007U) /* IP Payload Type */
#define ETH_DMAPTPRXDESC_IPPT_UDP \
  ((uint32_t) 0x00000001U) /* UDP payload encapsulated in the IP datagram */
#define ETH_DMAPTPRXDESC_IPPT_TCP \
  ((uint32_t) 0x00000002U) /* TCP payload encapsulated in the IP datagram */
#define ETH_DMAPTPRXDESC_IPPT_ICMP \
  ((uint32_t) 0x00000003U) /* ICMP payload encapsulated in the IP datagram */

/* Bit definition of RDES6 register */
#define ETH_DMAPTPRXDESC_RTSL \
  ((uint32_t) 0xFFFFFFFFU) /* Receive Time Stamp Low */

/* Bit definition of RDES7 register */
#define ETH_DMAPTPRXDESC_RTSH \
  ((uint32_t) 0xFFFFFFFFU) /* Receive Time Stamp High */

/**
 * @}
 */

/** @defgroup ETH_AutoNegotiation ETH AutoNegotiation
 * @{
 */
#define ETH_AUTONEGOTIATION_ENABLE ((uint32_t) 0x00000001U)
#define ETH_AUTONEGOTIATION_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Speed ETH Speed
 * @{
 */
#define ETH_SPEED_10M ((uint32_t) 0x00000000U)
#define ETH_SPEED_100M ((uint32_t) 0x00004000U)

/**
 * @}
 */

/** @defgroup ETH_Duplex_Mode ETH Duplex Mode
 * @{
 */
#define ETH_MODE_FULLDUPLEX ((uint32_t) 0x00000800U)
#define ETH_MODE_HALFDUPLEX ((uint32_t) 0x00000000U)

/**
 * @}
 */

