cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
/** @defgroup ETH_Rx_Mode ETH Rx Mode
 * @{
 */
#define ETH_RXPOLLING_MODE ((uint32_t) 0x00000000U)
#define ETH_RXINTERRUPT_MODE ((uint32_t) 0x00000001U)

/**
 * @}
 */

/** @defgroup ETH_Checksum_Mode ETH Checksum Mode
 * @{
 */
#define ETH_CHECKSUM_BY_HARDWARE ((uint32_t) 0x00000000U)
#define ETH_CHECKSUM_BY_SOFTWARE ((uint32_t) 0x00000001U)

/**
 * @}
 */

/** @defgroup ETH_Media_Interface ETH Media Interface
 * @{
 */
#define ETH_MEDIA_INTERFACE_MII ((uint32_t) 0x00000000U)
#define ETH_MEDIA_INTERFACE_RMII ((uint32_t) SYSCFG_PMC_MII_RMII_SEL)

/**
 * @}
 */

/** @defgroup ETH_Watchdog ETH Watchdog
 * @{
 */
#define ETH_WATCHDOG_ENABLE ((uint32_t) 0x00000000U)
#define ETH_WATCHDOG_DISABLE ((uint32_t) 0x00800000U)

/**
 * @}
 */

/** @defgroup ETH_Jabber ETH Jabber
 * @{
 */
#define ETH_JABBER_ENABLE ((uint32_t) 0x00000000U)
#define ETH_JABBER_DISABLE ((uint32_t) 0x00400000U)

/**
 * @}
 */

/** @defgroup ETH_Inter_Frame_Gap ETH Inter Frame Gap
 * @{
 */
#define ETH_INTERFRAMEGAP_96BIT                                                \
  ((uint32_t) 0x00000000U) /*!< minimum IFG between frames during transmission \
                              is 96Bit */
#define ETH_INTERFRAMEGAP_88BIT                                                \
  ((uint32_t) 0x00020000U) /*!< minimum IFG between frames during transmission \
                              is 88Bit */
#define ETH_INTERFRAMEGAP_80BIT                                                \
  ((uint32_t) 0x00040000U) /*!< minimum IFG between frames during transmission \
                              is 80Bit */
#define ETH_INTERFRAMEGAP_72BIT                                                \
  ((uint32_t) 0x00060000U) /*!< minimum IFG between frames during transmission \
                              is 72Bit */
#define ETH_INTERFRAMEGAP_64BIT                                                \
  ((uint32_t) 0x00080000U) /*!< minimum IFG between frames during transmission \
                              is 64Bit */
#define ETH_INTERFRAMEGAP_56BIT                                                \
  ((uint32_t) 0x000A0000U) /*!< minimum IFG between frames during transmission \
                              is 56Bit */
#define ETH_INTERFRAMEGAP_48BIT                                                \
  ((uint32_t) 0x000C0000U) /*!< minimum IFG between frames during transmission \
                              is 48Bit */
#define ETH_INTERFRAMEGAP_40BIT                                                \
  ((uint32_t) 0x000E0000U) /*!< minimum IFG between frames during transmission \
                              is 40Bit */

/**
 * @}
 */

/** @defgroup ETH_Carrier_Sense ETH Carrier Sense
 * @{
 */
#define ETH_CARRIERSENCE_ENABLE ((uint32_t) 0x00000000U)
#define ETH_CARRIERSENCE_DISABLE ((uint32_t) 0x00010000U)

/**
 * @}
 */

/** @defgroup ETH_Receive_Own ETH Receive Own
 * @{
 */
#define ETH_RECEIVEOWN_ENABLE ((uint32_t) 0x00000000U)
#define ETH_RECEIVEOWN_DISABLE ((uint32_t) 0x00002000U)

/**
 * @}
 */

/** @defgroup ETH_Loop_Back_Mode ETH Loop Back Mode
 * @{
 */
#define ETH_LOOPBACKMODE_ENABLE ((uint32_t) 0x00001000U)
#define ETH_LOOPBACKMODE_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Checksum_Offload ETH Checksum Offload
 * @{
 */
#define ETH_CHECKSUMOFFLAOD_ENABLE ((uint32_t) 0x00000400U)
#define ETH_CHECKSUMOFFLAOD_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Retry_Transmission ETH Retry Transmission
 * @{
 */
#define ETH_RETRYTRANSMISSION_ENABLE ((uint32_t) 0x00000000U)
#define ETH_RETRYTRANSMISSION_DISABLE ((uint32_t) 0x00000200U)

/**
 * @}
 */

/** @defgroup ETH_Automatic_Pad_CRC_Strip ETH Automatic Pad CRC Strip
 * @{
 */
#define ETH_AUTOMATICPADCRCSTRIP_ENABLE ((uint32_t) 0x00000080U)
#define ETH_AUTOMATICPADCRCSTRIP_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Back_Off_Limit ETH Back Off Limit
 * @{
 */
#define ETH_BACKOFFLIMIT_10 ((uint32_t) 0x00000000U)
#define ETH_BACKOFFLIMIT_8 ((uint32_t) 0x00000020U)
#define ETH_BACKOFFLIMIT_4 ((uint32_t) 0x00000040U)
#define ETH_BACKOFFLIMIT_1 ((uint32_t) 0x00000060U)

/**
 * @}
 */

/** @defgroup ETH_Deferral_Check ETH Deferral Check
 * @{
 */
#define ETH_DEFFERRALCHECK_ENABLE ((uint32_t) 0x00000010U)
#define ETH_DEFFERRALCHECK_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Receive_All ETH Receive All
 * @{
 */
#define ETH_RECEIVEALL_ENABLE ((uint32_t) 0x80000000U)
#define ETH_RECEIVEAll_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Source_Addr_Filter ETH Source Addr Filter
 * @{
 */
#define ETH_SOURCEADDRFILTER_NORMAL_ENABLE ((uint32_t) 0x00000200U)
#define ETH_SOURCEADDRFILTER_INVERSE_ENABLE ((uint32_t) 0x00000300U)
#define ETH_SOURCEADDRFILTER_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Pass_Control_Frames ETH Pass Control Frames
 * @{
 */
#define ETH_PASSCONTROLFRAMES_BLOCKALL                                       \
  ((uint32_t) 0x00000040U) /*!< MAC filters all control frames from reaching \
                              the application */
#define ETH_PASSCONTROLFRAMES_FORWARDALL                                       \
  ((uint32_t) 0x00000080U) /*!< MAC forwards all control frames to application \
                              even if they fail the Address Filter */
#define ETH_PASSCONTROLFRAMES_FORWARDPASSEDADDRFILTER                     \
  ((uint32_t) 0x000000C0U) /*!< MAC forwards control frames that pass the \
                              Address Filter. */

/**
 * @}
 */

/** @defgroup ETH_Broadcast_Frames_Reception ETH Broadcast Frames Reception
 * @{
 */
#define ETH_BROADCASTFRAMESRECEPTION_ENABLE ((uint32_t) 0x00000000U)
#define ETH_BROADCASTFRAMESRECEPTION_DISABLE ((uint32_t) 0x00000020U)

/**
 * @}
 */

/** @defgroup ETH_Destination_Addr_Filter ETH Destination Addr Filter
 * @{
 */
#define ETH_DESTINATIONADDRFILTER_NORMAL ((uint32_t) 0x00000000U)
#define ETH_DESTINATIONADDRFILTER_INVERSE ((uint32_t) 0x00000008U)

/**
 * @}
 */

/** @defgroup ETH_Promiscuous_Mode ETH Promiscuous Mode
 * @{
 */
#define ETH_PROMISCUOUS_MODE_ENABLE ((uint32_t) 0x00000001U)
#define ETH_PROMISCUOUS_MODE_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Multicast_Frames_Filter ETH Multicast Frames Filter
 * @{
 */
#define ETH_MULTICASTFRAMESFILTER_PERFECTHASHTABLE ((uint32_t) 0x00000404U)
#define ETH_MULTICASTFRAMESFILTER_HASHTABLE ((uint32_t) 0x00000004U)
#define ETH_MULTICASTFRAMESFILTER_PERFECT ((uint32_t) 0x00000000U)
#define ETH_MULTICASTFRAMESFILTER_NONE ((uint32_t) 0x00000010U)

/**
 * @}
 */

/** @defgroup ETH_Unicast_Frames_Filter ETH Unicast Frames Filter
 * @{
 */
#define ETH_UNICASTFRAMESFILTER_PERFECTHASHTABLE ((uint32_t) 0x00000402U)
#define ETH_UNICASTFRAMESFILTER_HASHTABLE ((uint32_t) 0x00000002U)
#define ETH_UNICASTFRAMESFILTER_PERFECT ((uint32_t) 0x00000000U)

/**
 * @}
 */

