cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
/** @defgroup ETH_Zero_Quanta_Pause ETH Zero Quanta Pause
 * @{
 */
#define ETH_ZEROQUANTAPAUSE_ENABLE ((uint32_t) 0x00000000U)
#define ETH_ZEROQUANTAPAUSE_DISABLE ((uint32_t) 0x00000080U)

/**
 * @}
 */

/** @defgroup ETH_Pause_Low_Threshold ETH Pause Low Threshold
 * @{
 */
#define ETH_PAUSELOWTHRESHOLD_MINUS4 \
  ((uint32_t) 0x00000000U) /*!< Pause time minus 4 slot times */
#define ETH_PAUSELOWTHRESHOLD_MINUS28 \
  ((uint32_t) 0x00000010U) /*!< Pause time minus 28 slot times */
#define ETH_PAUSELOWTHRESHOLD_MINUS144 \
  ((uint32_t) 0x00000020U) /*!< Pause time minus 144 slot times */
#define ETH_PAUSELOWTHRESHOLD_MINUS256 \
  ((uint32_t) 0x00000030U) /*!< Pause time minus 256 slot times */

/**
 * @}
 */

/** @defgroup ETH_Unicast_Pause_Frame_Detect ETH Unicast Pause Frame Detect
 * @{
 */
#define ETH_UNICASTPAUSEFRAMEDETECT_ENABLE ((uint32_t) 0x00000008U)
#define ETH_UNICASTPAUSEFRAMEDETECT_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Receive_Flow_Control ETH Receive Flow Control
 * @{
 */
#define ETH_RECEIVEFLOWCONTROL_ENABLE ((uint32_t) 0x00000004U)
#define ETH_RECEIVEFLOWCONTROL_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Transmit_Flow_Control ETH Transmit Flow Control
 * @{
 */
#define ETH_TRANSMITFLOWCONTROL_ENABLE ((uint32_t) 0x00000002U)
#define ETH_TRANSMITFLOWCONTROL_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_VLAN_Tag_Comparison ETH VLAN Tag Comparison
 * @{
 */
#define ETH_VLANTAGCOMPARISON_12BIT ((uint32_t) 0x00010000U)
#define ETH_VLANTAGCOMPARISON_16BIT ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_MAC_addresses ETH MAC addresses
 * @{
 */
#define ETH_MAC_ADDRESS0 ((uint32_t) 0x00000000U)
#define ETH_MAC_ADDRESS1 ((uint32_t) 0x00000008U)
#define ETH_MAC_ADDRESS2 ((uint32_t) 0x00000010U)
#define ETH_MAC_ADDRESS3 ((uint32_t) 0x00000018U)

/**
 * @}
 */

/** @defgroup ETH_MAC_addresses_filter_SA_DA ETH MAC addresses filter SA DA
 * @{
 */
#define ETH_MAC_ADDRESSFILTER_SA ((uint32_t) 0x00000000U)
#define ETH_MAC_ADDRESSFILTER_DA ((uint32_t) 0x00000008U)

/**
 * @}
 */

/** @defgroup ETH_MAC_addresses_filter_Mask_bytes ETH MAC addresses filter Mask
 * bytes
 * @{
 */
#define ETH_MAC_ADDRESSMASK_BYTE6 \
  ((uint32_t) 0x20000000U) /*!< Mask MAC Address high reg bits [15:8] */
#define ETH_MAC_ADDRESSMASK_BYTE5 \
  ((uint32_t) 0x10000000U) /*!< Mask MAC Address high reg bits [7:0] */
#define ETH_MAC_ADDRESSMASK_BYTE4 \
  ((uint32_t) 0x08000000U) /*!< Mask MAC Address low reg bits [31:24] */
#define ETH_MAC_ADDRESSMASK_BYTE3 \
  ((uint32_t) 0x04000000U) /*!< Mask MAC Address low reg bits [23:16] */
#define ETH_MAC_ADDRESSMASK_BYTE2 \
  ((uint32_t) 0x02000000U) /*!< Mask MAC Address low reg bits [15:8] */
#define ETH_MAC_ADDRESSMASK_BYTE1 \
  ((uint32_t) 0x01000000U) /*!< Mask MAC Address low reg bits [70] */

/**
 * @}
 */

/** @defgroup ETH_MAC_Debug_flags ETH MAC Debug flags
 * @{
 */
#ifndef ETH_MAC_TXFIFO_FULL
#define ETH_MAC_TXFIFO_FULL ((uint32_t) 0x02000000) /* Tx FIFO full */
#define ETH_MAC_TXFIFONOT_EMPTY                \
  ((uint32_t) 0x01000000) /* Tx FIFO not empty \
                           */
#define ETH_MAC_TXFIFO_WRITE_ACTIVE \
  ((uint32_t) 0x00400000) /* Tx FIFO write active */
#define ETH_MAC_TXFIFO_IDLE \
  ((uint32_t) 0x00000000) /* Tx FIFO read status: Idle */
#define ETH_MAC_TXFIFO_READ                                                  \
  ((uint32_t) 0x00100000) /* Tx FIFO read status: Read (transferring data to \
                             the MAC transmitter) */
#define ETH_MAC_TXFIFO_WAITING                                              \
  ((uint32_t) 0x00200000) /* Tx FIFO read status: Waiting for TxStatus from \
                             MAC transmitter */
#define ETH_MAC_TXFIFO_WRITING                                         \
  ((uint32_t) 0x00300000) /* Tx FIFO read status: Writing the received \
                             TxStatus or flushing the TxFIFO */
#define ETH_MAC_TRANSMISSION_PAUSE \
  ((uint32_t) 0x00080000) /* MAC transmitter in pause */
#define ETH_MAC_TRANSMITFRAMECONTROLLER_IDLE \
  ((uint32_t) 0x00000000) /* MAC transmit frame controller: Idle */
#define ETH_MAC_TRANSMITFRAMECONTROLLER_WAITING                                \
  ((uint32_t) 0x00020000) /* MAC transmit frame controller: Waiting for Status \
                             of previous frame or IFG/backoff period to be     \
                             over */
#define ETH_MAC_TRANSMITFRAMECONTROLLER_GENRATING_PCF                      \
  ((uint32_t) 0x00040000) /* MAC transmit frame controller: Generating and \
                             transmitting a Pause control frame (in full   \
                             duplex mode) */
#define ETH_MAC_TRANSMITFRAMECONTROLLER_TRANSFERRING                           \
  ((uint32_t) 0x00060000) /* MAC transmit frame controller: Transferring input \
                             frame for transmission */
#define ETH_MAC_MII_TRANSMIT_ACTIVE \
  ((uint32_t) 0x00010000) /* MAC MII transmit engine active */
#define ETH_MAC_RXFIFO_EMPTY \
  ((uint32_t) 0x00000000) /* Rx FIFO fill level: empty */
#define ETH_MAC_RXFIFO_BELOW_THRESHOLD                                         \
  ((uint32_t) 0x00000100) /* Rx FIFO fill level: fill-level below flow-control \
                             de-activate threshold */
#define ETH_MAC_RXFIFO_ABOVE_THRESHOLD                                         \
  ((uint32_t) 0x00000200) /* Rx FIFO fill level: fill-level above flow-control \
                             activate threshold */
#define ETH_MAC_RXFIFO_FULL \
  ((uint32_t) 0x00000300) /* Rx FIFO fill level: full */
#define ETH_MAC_READCONTROLLER_IDLE \
  ((uint32_t) 0x00000060) /* Rx FIFO read controller IDLE state */
#define ETH_MAC_READCONTROLLER_READING_DATA \
  ((uint32_t) 0x00000060) /* Rx FIFO read controller Reading frame data */
#define ETH_MAC_READCONTROLLER_READING_STATUS                                 \
  ((uint32_t) 0x00000060) /* Rx FIFO read controller Reading frame status (or \
                             time-stamp) */
#define ETH_MAC_READCONTROLLER_                                           \
  FLUSHING((uint32_t) 0x00000060) /* Rx FIFO read controller Flushing the \
                                     frame data and status */
#define ETH_MAC_RXFIFO_WRITE_ACTIVE \
  ((uint32_t) 0x00000010) /* Rx FIFO write controller active */
#define ETH_MAC_SMALL_FIFO_NOTACTIVE                                     \
  ((uint32_t) 0x00000000) /* MAC small FIFO read / write controllers not \
                             active */
#define ETH_MAC_SMALL_FIFO_READ_ACTIVE \
  ((uint32_t) 0x00000002) /* MAC small FIFO read controller active */
#define ETH_MAC_SMALL_FIFO_WRITE_ACTIVE \
  ((uint32_t) 0x00000004) /* MAC small FIFO write controller active */
#define ETH_MAC_SMALL_FIFO_RW_ACTIVE \
  ((uint32_t) 0x00000006) /* MAC small FIFO read / write controllers active */
#define ETH_MAC_MII_RECEIVE_PROTOCOL_ACTIVE \
  ((uint32_t) 0x00000001) /* MAC MII receive protocol engine active */
#else                     /* ifndef ETH_MAC_TXFIFO_FULL */
/* stm32_hal_legacy.h has probably been included. That file defines
 * 'ETH_MAC_TXFIFO_FULL' and all macro's here below. */
#endif                    /* ifndef ETH_MAC_TXFIFO_FULL */

/**
 * @}
 */

/** @defgroup ETH_Drop_TCP_IP_Checksum_Error_Frame ETH Drop TCP IP Checksum
 * Error Frame
 * @{
 */
#define ETH_DROPTCPIPCHECKSUMERRORFRAME_ENABLE ((uint32_t) 0x00000000U)
#define ETH_DROPTCPIPCHECKSUMERRORFRAME_DISABLE ((uint32_t) 0x04000000U)

/**
 * @}
 */

/** @defgroup ETH_Receive_Store_Forward ETH Receive Store Forward
 * @{
 */
#define ETH_RECEIVESTOREFORWARD_ENABLE ((uint32_t) 0x02000000U)
#define ETH_RECEIVESTOREFORWARD_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Flush_Received_Frame ETH Flush Received Frame
 * @{
 */
#define ETH_FLUSHRECEIVEDFRAME_ENABLE ((uint32_t) 0x00000000U)
#define ETH_FLUSHRECEIVEDFRAME_DISABLE ((uint32_t) 0x01000000U)

/**
 * @}
 */

/** @defgroup ETH_Transmit_Store_Forward ETH Transmit Store Forward
 * @{
 */
#define ETH_TRANSMITSTOREFORWARD_ENABLE ((uint32_t) 0x00200000U)
#define ETH_TRANSMITSTOREFORWARD_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Transmit_Threshold_Control ETH Transmit Threshold Control
 * @{
 */
#define ETH_TRANSMITTHRESHOLDCONTROL_64BYTES                                   \
  ((uint32_t) 0x00000000U) /*!< threshold level of the MTL Transmit FIFO is 64 \
                              Bytes */
#define ETH_TRANSMITTHRESHOLDCONTROL_128BYTES                               \
  ((uint32_t) 0x00004000U) /*!< threshold level of the MTL Transmit FIFO is \
                              128 Bytes */
#define ETH_TRANSMITTHRESHOLDCONTROL_192BYTES                               \
  ((uint32_t) 0x00008000U) /*!< threshold level of the MTL Transmit FIFO is \
                              192 Bytes */
#define ETH_TRANSMITTHRESHOLDCONTROL_256BYTES                               \
  ((uint32_t) 0x0000C000U) /*!< threshold level of the MTL Transmit FIFO is \
                              256 Bytes */
#define ETH_TRANSMITTHRESHOLDCONTROL_40BYTES                                   \
  ((uint32_t) 0x00010000U) /*!< threshold level of the MTL Transmit FIFO is 40 \
                              Bytes */
#define ETH_TRANSMITTHRESHOLDCONTROL_32BYTES                                   \
  ((uint32_t) 0x00014000U) /*!< threshold level of the MTL Transmit FIFO is 32 \
                              Bytes */
#define ETH_TRANSMITTHRESHOLDCONTROL_24BYTES                                   \
  ((uint32_t) 0x00018000U) /*!< threshold level of the MTL Transmit FIFO is 24 \
                              Bytes */
#define ETH_TRANSMITTHRESHOLDCONTROL_16BYTES                                   \
  ((uint32_t) 0x0001C000U) /*!< threshold level of the MTL Transmit FIFO is 16 \
                              Bytes */

/**
 * @}
 */

/** @defgroup ETH_Forward_Error_Frames ETH Forward Error Frames
 * @{
 */
#define ETH_FORWARDERRORFRAMES_ENABLE ((uint32_t) 0x00000080U)
#define ETH_FORWARDERRORFRAMES_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

