cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
/** @defgroup ETH_Forward_Undersized_Good_Frames ETH Forward Undersized Good
 * Frames
 * @{
 */
#define ETH_FORWARDUNDERSIZEDGOODFRAMES_ENABLE ((uint32_t) 0x00000040U)
#define ETH_FORWARDUNDERSIZEDGOODFRAMES_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Receive_Threshold_Control ETH Receive Threshold Control
 * @{
 */
#define ETH_RECEIVEDTHRESHOLDCONTROL_64BYTES                                  \
  ((uint32_t) 0x00000000U) /*!< threshold level of the MTL Receive FIFO is 64 \
                              Bytes */
#define ETH_RECEIVEDTHRESHOLDCONTROL_32BYTES                                  \
  ((uint32_t) 0x00000008U) /*!< threshold level of the MTL Receive FIFO is 32 \
                              Bytes */
#define ETH_RECEIVEDTHRESHOLDCONTROL_96BYTES                                  \
  ((uint32_t) 0x00000010U) /*!< threshold level of the MTL Receive FIFO is 96 \
                              Bytes */
#define ETH_RECEIVEDTHRESHOLDCONTROL_128BYTES                                  \
  ((uint32_t) 0x00000018U) /*!< threshold level of the MTL Receive FIFO is 128 \
                              Bytes */

/**
 * @}
 */

/** @defgroup ETH_Second_Frame_Operate ETH Second Frame Operate
 * @{
 */
#define ETH_SECONDFRAMEOPERARTE_ENABLE ((uint32_t) 0x00000004U)
#define ETH_SECONDFRAMEOPERARTE_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Address_Aligned_Beats ETH Address Aligned Beats
 * @{
 */
#define ETH_ADDRESSALIGNEDBEATS_ENABLE ((uint32_t) 0x02000000U)
#define ETH_ADDRESSALIGNEDBEATS_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Fixed_Burst ETH Fixed Burst
 * @{
 */
#define ETH_FIXEDBURST_ENABLE ((uint32_t) 0x00010000U)
#define ETH_FIXEDBURST_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_Rx_DMA_Burst_Length ETH Rx DMA Burst Length
 * @{
 */
#define ETH_RXDMABURSTLENGTH_1BEAT                                           \
  ((uint32_t) 0x00020000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 1 */
#define ETH_RXDMABURSTLENGTH_2BEAT                                           \
  ((uint32_t) 0x00040000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 2 */
#define ETH_RXDMABURSTLENGTH_4BEAT                                           \
  ((uint32_t) 0x00080000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 4 */
#define ETH_RXDMABURSTLENGTH_8BEAT                                           \
  ((uint32_t) 0x00100000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 8 */
#define ETH_RXDMABURSTLENGTH_16BEAT                                          \
  ((uint32_t) 0x00200000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 16 */
#define ETH_RXDMABURSTLENGTH_32BEAT                                          \
  ((uint32_t) 0x00400000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 32 */
#define ETH_RXDMABURSTLENGTH_4XPBL_4BEAT                                     \
  ((uint32_t) 0x01020000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 4 */
#define ETH_RXDMABURSTLENGTH_4XPBL_8BEAT                                     \
  ((uint32_t) 0x01040000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 8 */
#define ETH_RXDMABURSTLENGTH_4XPBL_16BEAT                                    \
  ((uint32_t) 0x01080000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 16 */
#define ETH_RXDMABURSTLENGTH_4XPBL_32BEAT                                    \
  ((uint32_t) 0x01100000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 32 */
#define ETH_RXDMABURSTLENGTH_4XPBL_64BEAT                                    \
  ((uint32_t) 0x01200000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 64 */
#define ETH_RXDMABURSTLENGTH_4XPBL_128BEAT                                   \
  ((uint32_t) 0x01400000U) /*!< maximum number of beats to be transferred in \
                              one RxDMA transaction is 128 */

/**
 * @}
 */

/** @defgroup ETH_Tx_DMA_Burst_Length ETH Tx DMA Burst Length
 * @{
 */
#define ETH_TXDMABURSTLENGTH_1BEAT                                           \
  ((uint32_t) 0x00000100U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 1 */
#define ETH_TXDMABURSTLENGTH_2BEAT                                           \
  ((uint32_t) 0x00000200U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 2 */
#define ETH_TXDMABURSTLENGTH_4BEAT                                           \
  ((uint32_t) 0x00000400U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 4 */
#define ETH_TXDMABURSTLENGTH_8BEAT                                           \
  ((uint32_t) 0x00000800U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 8 */
#define ETH_TXDMABURSTLENGTH_16BEAT                                          \
  ((uint32_t) 0x00001000U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 16 */
#define ETH_TXDMABURSTLENGTH_32BEAT                                          \
  ((uint32_t) 0x00002000U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 32 */
#define ETH_TXDMABURSTLENGTH_4XPBL_4BEAT                                     \
  ((uint32_t) 0x01000100U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 4 */
#define ETH_TXDMABURSTLENGTH_4XPBL_8BEAT                                     \
  ((uint32_t) 0x01000200U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 8 */
#define ETH_TXDMABURSTLENGTH_4XPBL_16BEAT                                    \
  ((uint32_t) 0x01000400U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 16 */
#define ETH_TXDMABURSTLENGTH_4XPBL_32BEAT                                    \
  ((uint32_t) 0x01000800U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 32 */
#define ETH_TXDMABURSTLENGTH_4XPBL_64BEAT                                    \
  ((uint32_t) 0x01001000U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 64 */
#define ETH_TXDMABURSTLENGTH_4XPBL_128BEAT                                   \
  ((uint32_t) 0x01002000U) /*!< maximum number of beats to be transferred in \
                              one TxDMA (or both) transaction is 128 */

/**
 * @}
 */

/** @defgroup ETH_DMA_Enhanced_descriptor_format ETH DMA Enhanced descriptor
 * format
 * @{
 */
#define ETH_DMAENHANCEDDESCRIPTOR_ENABLE ((uint32_t) 0x00000080U)
#define ETH_DMAENHANCEDDESCRIPTOR_DISABLE ((uint32_t) 0x00000000U)

/**
 * @}
 */

/** @defgroup ETH_DMA_Arbitration ETH DMA Arbitration
 * @{
 */
#define ETH_DMAARBITRATION_ROUNDROBIN_RXTX_1_1 ((uint32_t) 0x00000000U)
#define ETH_DMAARBITRATION_ROUNDROBIN_RXTX_2_1 ((uint32_t) 0x00004000U)
#define ETH_DMAARBITRATION_ROUNDROBIN_RXTX_3_1 ((uint32_t) 0x00008000U)
#define ETH_DMAARBITRATION_ROUNDROBIN_RXTX_4_1 ((uint32_t) 0x0000C000U)
#define ETH_DMAARBITRATION_RXPRIORTX ((uint32_t) 0x00000002U)

/**
 * @}
 */

