cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
/** @defgroup ETH_DMA_Tx_descriptor_segment ETH DMA Tx descriptor segment
 * @{
 */
#define ETH_DMATXDESC_LASTSEGMENTS           \
  ((uint32_t) 0x40000000U) /*!< Last Segment \
                            */
#define ETH_DMATXDESC_FIRSTSEGMENT \
  ((uint32_t) 0x20000000U) /*!< First Segment */

/**
 * @}
 */

/** @defgroup ETH_DMA_Tx_descriptor_Checksum_Insertion_Control ETH DMA Tx
 * descriptor Checksum Insertion Control
 * @{
 */
#define ETH_DMATXDESC_CHECKSUMBYPASS \
  ((uint32_t) 0x00000000U) /*!< Checksum engine bypass */
#define ETH_DMATXDESC_CHECKSUMIPV4HEADER \
  ((uint32_t) 0x00400000U) /*!< IPv4 header checksum insertion  */
#define ETH_DMATXDESC_CHECKSUMTCPUDPICMPSEGMENT                                \
  ((uint32_t) 0x00800000U) /*!< TCP/UDP/ICMP checksum insertion. Pseudo header \
                              checksum is assumed to be present */
#define ETH_DMATXDESC_CHECKSUMTCPUDPICMPFULL                            \
  ((uint32_t) 0x00C00000U) /*!< TCP/UDP/ICMP checksum fully in hardware \
                              including pseudo header */

/**
 * @}
 */

/** @defgroup ETH_DMA_Rx_descriptor_buffers ETH DMA Rx descriptor buffers
 * @{
 */
#define ETH_DMARXDESC_BUFFER1 \
  ((uint32_t) 0x00000000U) /*!< DMA Rx Desc Buffer1 */
#define ETH_DMARXDESC_BUFFER2 \
  ((uint32_t) 0x00000001U) /*!< DMA Rx Desc Buffer2 */

/**
 * @}
 */

/** @defgroup ETH_PMT_Flags ETH PMT Flags
 * @{
 */
#define ETH_PMT_FLAG_WUFFRPR \
  ((uint32_t) 0x80000000U) /*!< Wake-Up Frame Filter Register Pointer Reset */
#define ETH_PMT_FLAG_WUFR \
  ((uint32_t) 0x00000040U) /*!< Wake-Up Frame Received */
#define ETH_PMT_FLAG_MPR                              \
  ((uint32_t) 0x00000020U) /*!< Magic Packet Received \
                            */

/**
 * @}
 */

/** @defgroup ETH_MMC_Tx_Interrupts ETH MMC Tx Interrupts
 * @{
 */
#define ETH_MMC_IT_TGF                                                      \
  ((uint32_t) 0x00200000U) /*!< When Tx good frame counter reaches half the \
                              maximum value */
#define ETH_MMC_IT_TGFMSC                                                   \
  ((uint32_t) 0x00008000U) /*!< When Tx good multi col counter reaches half \
                              the maximum value */
#define ETH_MMC_IT_TGFSC                                                     \
  ((uint32_t) 0x00004000U) /*!< When Tx good single col counter reaches half \
                              the maximum value */

/**
 * @}
 */

/** @defgroup ETH_MMC_Rx_Interrupts ETH MMC Rx Interrupts
 * @{
 */
#define ETH_MMC_IT_RGUF                                                     \
  ((uint32_t) 0x10020000U) /*!< When Rx good unicast frames counter reaches \
                              half the maximum value */
#define ETH_MMC_IT_RFAE                                                      \
  ((uint32_t) 0x10000040U) /*!< When Rx alignment error counter reaches half \
                              the maximum value */
#define ETH_MMC_IT_RFCE                                                    \
  ((uint32_t) 0x10000020U) /*!< When Rx crc error counter reaches half the \
                              maximum value */

/**
 * @}
 */

/** @defgroup ETH_MAC_Flags ETH MAC Flags
 * @{
 */
#define ETH_MAC_FLAG_TST \
  ((uint32_t) 0x00000200U) /*!< Time stamp trigger flag (on MAC) */
#define ETH_MAC_FLAG_MMCT ((uint32_t) 0x00000040U) /*!< MMC transmit flag  */
#define ETH_MAC_FLAG_MMCR ((uint32_t) 0x00000020U) /*!< MMC receive flag */
#define ETH_MAC_FLAG_MMC ((uint32_t) 0x00000010U)  /*!< MMC flag (on MAC) */
#define ETH_MAC_FLAG_PMT ((uint32_t) 0x00000008U)  /*!< PMT flag (on MAC) */

/**
 * @}
 */

/** @defgroup ETH_DMA_Flags ETH DMA Flags
 * @{
 */
#define ETH_DMA_FLAG_TST \
  ((uint32_t) 0x20000000U) /*!< Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_FLAG_PMT                               \
  ((uint32_t) 0x10000000U) /*!< PMT interrupt (on DMA) \
                            */
#define ETH_DMA_FLAG_MMC                               \
  ((uint32_t) 0x08000000U) /*!< MMC interrupt (on DMA) \
                            */
#define ETH_DMA_FLAG_DATATRANSFERERROR \
  ((uint32_t) 0x00800000U) /*!< Error bits 0-Rx DMA, 1-Tx DMA */
#define ETH_DMA_FLAG_READWRITEERROR                                          \
  ((uint32_t) 0x01000000U) /*!< Error bits 0-write transfer, 1-read transfer \
                            */
#define ETH_DMA_FLAG_ACCESSERROR \
  ((uint32_t) 0x02000000U) /*!< Error bits 0-data buffer, 1-desc. access */
#define ETH_DMA_FLAG_NIS \
  ((uint32_t) 0x00010000U) /*!< Normal interrupt summary flag */
#define ETH_DMA_FLAG_AIS \
  ((uint32_t) 0x00008000U) /*!< Abnormal interrupt summary flag */
#define ETH_DMA_FLAG_ER ((uint32_t) 0x00004000U)  /*!< Early receive flag */
#define ETH_DMA_FLAG_FBE ((uint32_t) 0x00002000U) /*!< Fatal bus error flag */
#define ETH_DMA_FLAG_ET ((uint32_t) 0x00000400U)  /*!< Early transmit flag */
#define ETH_DMA_FLAG_RWT \
  ((uint32_t) 0x00000200U) /*!< Receive watchdog timeout flag */
#define ETH_DMA_FLAG_RPS \
  ((uint32_t) 0x00000100U) /*!< Receive process stopped flag */
#define ETH_DMA_FLAG_RBU \
  ((uint32_t) 0x00000080U) /*!< Receive buffer unavailable flag */
#define ETH_DMA_FLAG_R ((uint32_t) 0x00000040U)  /*!< Receive flag */
#define ETH_DMA_FLAG_TU ((uint32_t) 0x00000020U) /*!< Underflow flag */
#define ETH_DMA_FLAG_RO ((uint32_t) 0x00000010U) /*!< Overflow flag */
#define ETH_DMA_FLAG_TJT \
  ((uint32_t) 0x00000008U) /*!< Transmit jabber timeout flag */
#define ETH_DMA_FLAG_TBU \
  ((uint32_t) 0x00000004U) /*!< Transmit buffer unavailable flag */
#define ETH_DMA_FLAG_TPS \
  ((uint32_t) 0x00000002U) /*!< Transmit process stopped flag */
#define ETH_DMA_FLAG_T ((uint32_t) 0x00000001U) /*!< Transmit flag */

/**
 * @}
 */

/** @defgroup ETH_MAC_Interrupts ETH MAC Interrupts
 * @{
 */
#define ETH_MAC_IT_TST \
  ((uint32_t) 0x00000200U) /*!< Time stamp trigger interrupt (on MAC) */
#define ETH_MAC_IT_MMCT                                                      \
  ((uint32_t) 0x00000040U)                       /*!< MMC transmit interrupt \
                                                  */
#define ETH_MAC_IT_MMCR ((uint32_t) 0x00000020U) /*!< MMC receive interrupt */
#define ETH_MAC_IT_MMC ((uint32_t) 0x00000010U)  /*!< MMC interrupt (on MAC) */
#define ETH_MAC_IT_PMT ((uint32_t) 0x00000008U)  /*!< PMT interrupt (on MAC) */

/**
 * @}
 */

