cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
/** @defgroup ETH_DMA_Interrupts ETH DMA Interrupts
 * @{
 */
#define ETH_DMA_IT_TST \
  ((uint32_t) 0x20000000U) /*!< Time-stamp trigger interrupt (on DMA) */
#define ETH_DMA_IT_PMT ((uint32_t) 0x10000000U) /*!< PMT interrupt (on DMA) */
#define ETH_DMA_IT_MMC ((uint32_t) 0x08000000U) /*!< MMC interrupt (on DMA) */
#define ETH_DMA_IT_NIS                                   \
  ((uint32_t) 0x00010000U) /*!< Normal interrupt summary \
                            */
#define ETH_DMA_IT_AIS \
  ((uint32_t) 0x00008000U) /*!< Abnormal interrupt summary */
#define ETH_DMA_IT_ER ((uint32_t) 0x00004000U) /*!< Early receive interrupt */
#define ETH_DMA_IT_FBE \
  ((uint32_t) 0x00002000U) /*!< Fatal bus error interrupt */
#define ETH_DMA_IT_ET                                    \
  ((uint32_t) 0x00000400U) /*!< Early transmit interrupt \
                            */
#define ETH_DMA_IT_RWT \
  ((uint32_t) 0x00000200U) /*!< Receive watchdog timeout interrupt */
#define ETH_DMA_IT_RPS \
  ((uint32_t) 0x00000100U) /*!< Receive process stopped interrupt */
#define ETH_DMA_IT_RBU \
  ((uint32_t) 0x00000080U) /*!< Receive buffer unavailable interrupt */
#define ETH_DMA_IT_R ((uint32_t) 0x00000040U)  /*!< Receive interrupt */
#define ETH_DMA_IT_TU ((uint32_t) 0x00000020U) /*!< Underflow interrupt */
#define ETH_DMA_IT_RO ((uint32_t) 0x00000010U) /*!< Overflow interrupt */
#define ETH_DMA_IT_TJT \
  ((uint32_t) 0x00000008U) /*!< Transmit jabber timeout interrupt */
#define ETH_DMA_IT_TBU \
  ((uint32_t) 0x00000004U) /*!< Transmit buffer unavailable interrupt */
#define ETH_DMA_IT_TPS \
  ((uint32_t) 0x00000002U) /*!< Transmit process stopped interrupt */
#define ETH_DMA_IT_T ((uint32_t) 0x00000001U) /*!< Transmit interrupt */

/**
 * @}
 */

/** @defgroup ETH_DMA_transmit_process_state ETH DMA transmit process state
 * @{
 */
#define ETH_DMA_TRANSMITPROCESS_STOPPED \
  ((uint32_t) 0x00000000U) /*!< Stopped - Reset or Stop Tx Command issued */
#define ETH_DMA_TRANSMITPROCESS_FETCHING \
  ((uint32_t) 0x00100000U) /*!< Running - fetching the Tx descriptor */
#define ETH_DMA_TRANSMITPROCESS_WAITING \
  ((uint32_t) 0x00200000U) /*!< Running - waiting for status */
#define ETH_DMA_TRANSMITPROCESS_READING \
  ((uint32_t) 0x00300000U) /*!< Running - reading the data from host memory */
#define ETH_DMA_TRANSMITPROCESS_SUSPENDED \
  ((uint32_t) 0x00600000U) /*!< Suspended - Tx Descriptor unavailable */
#define ETH_DMA_TRANSMITPROCESS_CLOSING \
  ((uint32_t) 0x00700000U) /*!< Running - closing Rx descriptor */

/**
 * @}
 */

/** @defgroup ETH_DMA_receive_process_state ETH DMA receive process state
 * @{
 */
#define ETH_DMA_RECEIVEPROCESS_STOPPED \
  ((uint32_t) 0x00000000U) /*!< Stopped - Reset or Stop Rx Command issued */
#define ETH_DMA_RECEIVEPROCESS_FETCHING \
  ((uint32_t) 0x00020000U) /*!< Running - fetching the Rx descriptor */
#define ETH_DMA_RECEIVEPROCESS_WAITING \
  ((uint32_t) 0x00060000U) /*!< Running - waiting for packet */
#define ETH_DMA_RECEIVEPROCESS_SUSPENDED \
  ((uint32_t) 0x00080000U) /*!< Suspended - Rx Descriptor unavailable */
#define ETH_DMA_RECEIVEPROCESS_CLOSING \
  ((uint32_t) 0x000A0000U) /*!< Running - closing descriptor */
#define ETH_DMA_RECEIVEPROCESS_QUEUING                                        \
  ((uint32_t) 0x000E0000U) /*!< Running - queuing the receive frame into host \
                              memory */

/**
 * @}
 */

/** @defgroup ETH_DMA_overflow ETH DMA overflow
 * @{
 */
#define ETH_DMA_OVERFLOW_RXFIFOCOUNTER \
  ((uint32_t) 0x10000000U) /*!< Overflow bit for FIFO overflow counter */
#define ETH_DMA_OVERFLOW_MISSEDFRAMECOUNTER \
  ((uint32_t) 0x00010000U) /*!< Overflow bit for missed frame counter */

/**
 * @}
 */

/** @defgroup ETH_EXTI_LINE_WAKEUP ETH EXTI LINE WAKEUP
 * @{
 */
#define ETH_EXTI_LINE_WAKEUP                                                \
  ((uint32_t) 0x00080000U) /*!< External interrupt line 19 Connected to the \
                              ETH EXTI Line */

/**
 * @}
 */

/**
 * @}
 */

/* Exported macro ------------------------------------------------------------*/

/** @defgroup ETH_Exported_Macros ETH Exported Macros
 *  @brief macros to handle interrupts and specific clock configurations
 * @{
 */

/** @brief Reset ETH handle state
 * @param  __HANDLE__: specifies the ETH handle.
 * @retval None
 */
#define __HAL_ETH_RESET_HANDLE_STATE(__HANDLE__) \
  ((__HANDLE__)->State = HAL_ETH_STATE_RESET)

/**
 * @brief  Checks whether the specified Ethernet DMA Tx Desc flag is set or not.
 * @param  __HANDLE__: ETH Handle
 * @param  __FLAG__: specifies the flag of TDES0 to check.
 * @retval the ETH_DMATxDescFlag (SET or RESET).
 */
#define __HAL_ETH_DMATXDESC_GET_FLAG(__HANDLE__, __FLAG__) \
  ((__HANDLE__)->TxDesc->Status & (__FLAG__) == (__FLAG__))

/**
 * @brief  Checks whether the specified Ethernet DMA Rx Desc flag is set or not.
 * @param  __HANDLE__: ETH Handle
 * @param  __FLAG__: specifies the flag of RDES0 to check.
 * @retval the ETH_DMATxDescFlag (SET or RESET).
 */
#define __HAL_ETH_DMARXDESC_GET_FLAG(__HANDLE__, __FLAG__) \
  ((__HANDLE__)->RxDesc->Status & (__FLAG__) == (__FLAG__))

/**
 * @brief  Enables the specified DMA Rx Desc receive interrupt.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMARXDESC_ENABLE_IT(__HANDLE__) \
  ((__HANDLE__)->RxDesc->ControlBufferSize &= (~(uint32_t) ETH_DMARXDESC_DIC))

/**
 * @brief  Disables the specified DMA Rx Desc receive interrupt.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMARXDESC_DISABLE_IT(__HANDLE__) \
  ((__HANDLE__)->RxDesc->ControlBufferSize |= ETH_DMARXDESC_DIC)

/**
 * @brief  Set the specified DMA Rx Desc Own bit.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMARXDESC_SET_OWN_BIT(__HANDLE__) \
  ((__HANDLE__)->RxDesc->Status |= ETH_DMARXDESC_OWN)

/**
 * @brief  Returns the specified Ethernet DMA Tx Desc collision count.
 * @param  __HANDLE__: ETH Handle
 * @retval The Transmit descriptor collision counter value.
 */
#define __HAL_ETH_DMATXDESC_GET_COLLISION_COUNT(__HANDLE__) \
  (((__HANDLE__)->TxDesc->Status & ETH_DMATXDESC_CC) >>     \
   ETH_DMATXDESC_COLLISION_COUNTSHIFT)

/**
 * @brief  Set the specified DMA Tx Desc Own bit.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMATXDESC_SET_OWN_BIT(__HANDLE__) \
  ((__HANDLE__)->TxDesc->Status |= ETH_DMATXDESC_OWN)

/**
 * @brief  Enables the specified DMA Tx Desc Transmit interrupt.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMATXDESC_ENABLE_IT(__HANDLE__) \
  ((__HANDLE__)->TxDesc->Status |= ETH_DMATXDESC_IC)

/**
 * @brief  Disables the specified DMA Tx Desc Transmit interrupt.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMATXDESC_DISABLE_IT(__HANDLE__) \
  ((__HANDLE__)->TxDesc->Status &= ~ETH_DMATXDESC_IC)

/**
 * @brief  Selects the specified Ethernet DMA Tx Desc Checksum Insertion.
 * @param  __HANDLE__: ETH Handle
 * @param  __CHECKSUM__: specifies is the DMA Tx desc checksum insertion.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMATXDESC_CHECKSUMBYPASS : Checksum bypass
 *     @arg ETH_DMATXDESC_CHECKSUMIPV4HEADER : IPv4 header checksum
 *     @arg ETH_DMATXDESC_CHECKSUMTCPUDPICMPSEGMENT : TCP/UDP/ICMP checksum.
 * Pseudo header checksum is assumed to be present
 *     @arg ETH_DMATXDESC_CHECKSUMTCPUDPICMPFULL : TCP/UDP/ICMP checksum fully
 * in hardware including pseudo header
 * @retval None
 */
#define __HAL_ETH_DMATXDESC_CHECKSUM_INSERTION(__HANDLE__, __CHECKSUM__) \
  ((__HANDLE__)->TxDesc->Status |= (__CHECKSUM__))

/**
 * @brief  Enables the DMA Tx Desc CRC.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMATXDESC_CRC_ENABLE(__HANDLE__) \
  ((__HANDLE__)->TxDesc->Status &= ~ETH_DMATXDESC_DC)

/**
 * @brief  Disables the DMA Tx Desc CRC.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMATXDESC_CRC_DISABLE(__HANDLE__) \
  ((__HANDLE__)->TxDesc->Status |= ETH_DMATXDESC_DC)

/**
 * @brief  Enables the DMA Tx Desc padding for frame shorter than 64 bytes.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMATXDESC_SHORT_FRAME_PADDING_ENABLE(__HANDLE__) \
  ((__HANDLE__)->TxDesc->Status &= ~ETH_DMATXDESC_DP)

/**
 * @brief  Disables the DMA Tx Desc padding for frame shorter than 64 bytes.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_DMATXDESC_SHORT_FRAME_PADDING_DISABLE(__HANDLE__) \
  ((__HANDLE__)->TxDesc->Status |= ETH_DMATXDESC_DP)

/**
 * @brief  Enables the specified Ethernet MAC interrupts.
 * @param  __HANDLE__   : ETH Handle
 * @param  __INTERRUPT__: specifies the Ethernet MAC interrupt sources to be
 *   enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_MAC_IT_TST : Time stamp trigger interrupt
 *     @arg ETH_MAC_IT_PMT : PMT interrupt
 * @retval None
 */
#define __HAL_ETH_MAC_ENABLE_IT(__HANDLE__, __INTERRUPT__) \
  ((__HANDLE__)->Instance->MACIMR |= (__INTERRUPT__))

/**
 * @brief  Disables the specified Ethernet MAC interrupts.
 * @param  __HANDLE__   : ETH Handle
 * @param  __INTERRUPT__: specifies the Ethernet MAC interrupt sources to be
 *   enabled or disabled.
 *   This parameter can be any combination of the following values:
 *     @arg ETH_MAC_IT_TST : Time stamp trigger interrupt
 *     @arg ETH_MAC_IT_PMT : PMT interrupt
 * @retval None
 */
#define __HAL_ETH_MAC_DISABLE_IT(__HANDLE__, __INTERRUPT__) \
  ((__HANDLE__)->Instance->MACIMR &= ~(__INTERRUPT__))

/**
 * @brief  Initiate a Pause Control Frame (Full-duplex only).
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_INITIATE_PAUSE_CONTROL_FRAME(__HANDLE__) \
  ((__HANDLE__)->Instance->MACFCR |= ETH_MACFCR_FCBBPA)

/**
 * @brief  Checks whether the Ethernet flow control busy bit is set or not.
 * @param  __HANDLE__: ETH Handle
 * @retval The new state of flow control busy status bit (SET or RESET).
 */
#define __HAL_ETH_GET_FLOW_CONTROL_BUSY_STATUS(__HANDLE__) \
  (((__HANDLE__)->Instance->MACFCR & ETH_MACFCR_FCBBPA) == ETH_MACFCR_FCBBPA)

/**
 * @brief  Enables the MAC Back Pressure operation activation (Half-duplex
 * only).
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_BACK_PRESSURE_ACTIVATION_ENABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACFCR |= ETH_MACFCR_FCBBPA)

/**
 * @brief  Disables the MAC BackPressure operation activation (Half-duplex
 * only).
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_BACK_PRESSURE_ACTIVATION_DISABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACFCR &= ~ETH_MACFCR_FCBBPA)

/**
 * @brief  Checks whether the specified Ethernet MAC flag is set or not.
 * @param  __HANDLE__: ETH Handle
 * @param  __FLAG__: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_MAC_FLAG_TST  : Time stamp trigger flag
 *     @arg ETH_MAC_FLAG_MMCT : MMC transmit flag
 *     @arg ETH_MAC_FLAG_MMCR : MMC receive flag
 *     @arg ETH_MAC_FLAG_MMC  : MMC flag
 *     @arg ETH_MAC_FLAG_PMT  : PMT flag
 * @retval The state of Ethernet MAC flag.
 */
#define __HAL_ETH_MAC_GET_FLAG(__HANDLE__, __FLAG__) \
  (((__HANDLE__)->Instance->MACSR & (__FLAG__)) == (__FLAG__))

/**
 * @brief  Enables the specified Ethernet DMA interrupts.
 * @param  __HANDLE__   : ETH Handle
 * @param  __INTERRUPT__: specifies the Ethernet DMA interrupt sources to be
 *   enabled @ref ETH_DMA_Interrupts
 * @retval None
 */
#define __HAL_ETH_DMA_ENABLE_IT(__HANDLE__, __INTERRUPT__) \
  ((__HANDLE__)->Instance->DMAIER |= (__INTERRUPT__))

/**
 * @brief  Disables the specified Ethernet DMA interrupts.
 * @param  __HANDLE__   : ETH Handle
 * @param  __INTERRUPT__: specifies the Ethernet DMA interrupt sources to be
 *   disabled. @ref ETH_DMA_Interrupts
 * @retval None
 */
#define __HAL_ETH_DMA_DISABLE_IT(__HANDLE__, __INTERRUPT__) \
  ((__HANDLE__)->Instance->DMAIER &= ~(__INTERRUPT__))

/**
 * @brief  Clears the Ethernet DMA IT pending bit.
 * @param  __HANDLE__   : ETH Handle
 * @param  __INTERRUPT__: specifies the interrupt pending bit to clear. @ref
 * ETH_DMA_Interrupts
 * @retval None
 */
#define __HAL_ETH_DMA_CLEAR_IT(__HANDLE__, __INTERRUPT__) \
  ((__HANDLE__)->Instance->DMASR = (__INTERRUPT__))

/**
 * @brief  Checks whether the specified Ethernet DMA flag is set or not.
 * @param  __HANDLE__: ETH Handle
 * @param  __FLAG__: specifies the flag to check. @ref ETH_DMA_Flags
 * @retval The new state of ETH_DMA_FLAG (SET or RESET).
 */
#define __HAL_ETH_DMA_GET_FLAG(__HANDLE__, __FLAG__) \
  (((__HANDLE__)->Instance->DMASR & (__FLAG__)) == (__FLAG__))

/**
 * @brief  Checks whether the specified Ethernet DMA flag is set or not.
 * @param  __HANDLE__: ETH Handle
 * @param  __FLAG__: specifies the flag to clear. @ref ETH_DMA_Flags
 * @retval The new state of ETH_DMA_FLAG (SET or RESET).
 */
#define __HAL_ETH_DMA_CLEAR_FLAG(__HANDLE__, __FLAG__) \
  ((__HANDLE__)->Instance->DMASR = (__FLAG__))

/**
 * @brief  Checks whether the specified Ethernet DMA overflow flag is set or
 * not.
 * @param  __HANDLE__: ETH Handle
 * @param  __OVERFLOW__: specifies the DMA overflow flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_DMA_OVERFLOW_RXFIFOCOUNTER : Overflow for FIFO Overflows Counter
 *     @arg ETH_DMA_OVERFLOW_MISSEDFRAMECOUNTER : Overflow for Buffer
 * Unavailable Missed Frame Counter
 * @retval The state of Ethernet DMA overflow Flag (SET or RESET).
 */
#define __HAL_ETH_GET_DMA_OVERFLOW_STATUS(__HANDLE__, __OVERFLOW__) \
  (((__HANDLE__)->Instance->DMAMFBOCR & (__OVERFLOW__)) == (__OVERFLOW__))

/**
 * @brief  Set the DMA Receive status watchdog timer register value
 * @param  __HANDLE__: ETH Handle
 * @param  __VALUE__: DMA Receive status watchdog timer register value
 * @retval None
 */
#define __HAL_ETH_SET_RECEIVE_WATCHDOG_TIMER(__HANDLE__, __VALUE__) \
  ((__HANDLE__)->Instance->DMARSWTR = (__VALUE__))

/**
 * @brief  Enables any unicast packet filtered by the MAC address
 *   recognition to be a wake-up frame.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_GLOBAL_UNICAST_WAKEUP_ENABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACPMTCSR |= ETH_MACPMTCSR_GU)

/**
 * @brief  Disables any unicast packet filtered by the MAC address
 *   recognition to be a wake-up frame.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_GLOBAL_UNICAST_WAKEUP_DISABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACPMTCSR &= ~ETH_MACPMTCSR_GU)

/**
 * @brief  Enables the MAC Wake-Up Frame Detection.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_FRAME_DETECTION_ENABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACPMTCSR |= ETH_MACPMTCSR_WFE)

/**
 * @brief  Disables the MAC Wake-Up Frame Detection.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_FRAME_DETECTION_DISABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACPMTCSR &= ~ETH_MACPMTCSR_WFE)

/**
 * @brief  Enables the MAC Magic Packet Detection.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_MAGIC_PACKET_DETECTION_ENABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACPMTCSR |= ETH_MACPMTCSR_MPE)

/**
 * @brief  Disables the MAC Magic Packet Detection.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_MAGIC_PACKET_DETECTION_DISABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACPMTCSR &= ~ETH_MACPMTCSR_WFE)

/**
 * @brief  Enables the MAC Power Down.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_POWER_DOWN_ENABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACPMTCSR |= ETH_MACPMTCSR_PD)

/**
 * @brief  Disables the MAC Power Down.
 * @param  __HANDLE__: ETH Handle
 * @retval None
 */
#define __HAL_ETH_POWER_DOWN_DISABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MACPMTCSR &= ~ETH_MACPMTCSR_PD)

/**
 * @brief  Checks whether the specified Ethernet PMT flag is set or not.
 * @param  __HANDLE__: ETH Handle.
 * @param  __FLAG__: specifies the flag to check.
 *   This parameter can be one of the following values:
 *     @arg ETH_PMT_FLAG_WUFFRPR : Wake-Up Frame Filter Register Pointer Reset
 *     @arg ETH_PMT_FLAG_WUFR    : Wake-Up Frame Received
 *     @arg ETH_PMT_FLAG_MPR     : Magic Packet Received
 * @retval The new state of Ethernet PMT Flag (SET or RESET).
 */
#define __HAL_ETH_GET_PMT_FLAG_STATUS(__HANDLE__, __FLAG__) \
  (((__HANDLE__)->Instance->MACPMTCSR & (__FLAG__)) == (__FLAG__))

/**
 * @brief  Preset and Initialize the MMC counters to almost-full value:
 * 0xFFFF_FFF0 (full - 16)
 * @param   __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_MMC_COUNTER_FULL_PRESET(__HANDLE__) \
  ((__HANDLE__)->Instance->MMCCR |= (ETH_MMCCR_MCFHP | ETH_MMCCR_MCP))

/**
 * @brief  Preset and Initialize the MMC counters to almost-half value:
 * 0x7FFF_FFF0 (half - 16)
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_MMC_COUNTER_HALF_PRESET(__HANDLE__)  \
  do {                                                 \
    (__HANDLE__)->Instance->MMCCR &= ~ETH_MMCCR_MCFHP; \
    (__HANDLE__)->Instance->MMCCR |= ETH_MMCCR_MCP;    \
  } while (0)

/**
 * @brief  Enables the MMC Counter Freeze.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_MMC_COUNTER_FREEZE_ENABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MMCCR |= ETH_MMCCR_MCF)

/**
 * @brief  Disables the MMC Counter Freeze.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_MMC_COUNTER_FREEZE_DISABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MMCCR &= ~ETH_MMCCR_MCF)

/**
 * @brief  Enables the MMC Reset On Read.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_ETH_MMC_RESET_ONREAD_ENABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MMCCR |= ETH_MMCCR_ROR)

/**
 * @brief  Disables the MMC Reset On Read.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_ETH_MMC_RESET_ONREAD_DISABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MMCCR &= ~ETH_MMCCR_ROR)

/**
 * @brief  Enables the MMC Counter Stop Rollover.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_ETH_MMC_COUNTER_ROLLOVER_ENABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MMCCR &= ~ETH_MMCCR_CSR)

/**
 * @brief  Disables the MMC Counter Stop Rollover.
 * @param  __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_ETH_MMC_COUNTER_ROLLOVER_DISABLE(__HANDLE__) \
  ((__HANDLE__)->Instance->MMCCR |= ETH_MMCCR_CSR)

/**
 * @brief  Resets the MMC Counters.
 * @param   __HANDLE__: ETH Handle.
 * @retval None
 */
#define __HAL_ETH_MMC_COUNTERS_RESET(__HANDLE__) \
  ((__HANDLE__)->Instance->MMCCR |= ETH_MMCCR_CR)

/**
 * @brief  Enables the specified Ethernet MMC Rx interrupts.
 * @param   __HANDLE__: ETH Handle.
 * @param  __INTERRUPT__: specifies the Ethernet MMC interrupt sources to be
 * enabled or disabled. This parameter can be one of the following values:
 *     @arg ETH_MMC_IT_RGUF  : When Rx good unicast frames counter reaches half
 * the maximum value
 *     @arg ETH_MMC_IT_RFAE  : When Rx alignment error counter reaches half the
 * maximum value
 *     @arg ETH_MMC_IT_RFCE  : When Rx crc error counter reaches half the
 * maximum value
 * @retval None
 */
#define __HAL_ETH_MMC_RX_IT_ENABLE(__HANDLE__, __INTERRUPT__) \
  (__HANDLE__)->Instance->MMCRIMR &= ~((__INTERRUPT__) &0xEFFFFFFF)

/**
 * @brief  Disables the specified Ethernet MMC Rx interrupts.
 * @param   __HANDLE__: ETH Handle.
 * @param  __INTERRUPT__: specifies the Ethernet MMC interrupt sources to be
 * enabled or disabled. This parameter can be one of the following values:
 *     @arg ETH_MMC_IT_RGUF  : When Rx good unicast frames counter reaches half
 * the maximum value
 *     @arg ETH_MMC_IT_RFAE  : When Rx alignment error counter reaches half the
 * maximum value
 *     @arg ETH_MMC_IT_RFCE  : When Rx crc error counter reaches half the
 * maximum value
 * @retval None
 */
#define __HAL_ETH_MMC_RX_IT_DISABLE(__HANDLE__, __INTERRUPT__) \
  (__HANDLE__)->Instance->MMCRIMR |= ((__INTERRUPT__) &0xEFFFFFFF)

/**
 * @brief  Enables the specified Ethernet MMC Tx interrupts.
 * @param   __HANDLE__: ETH Handle.
 * @param  __INTERRUPT__: specifies the Ethernet MMC interrupt sources to be
 * enabled or disabled. This parameter can be one of the following values:
 *     @arg ETH_MMC_IT_TGF   : When Tx good frame counter reaches half the
 * maximum value
 *     @arg ETH_MMC_IT_TGFMSC: When Tx good multi col counter reaches half the
 * maximum value
 *     @arg ETH_MMC_IT_TGFSC : When Tx good single col counter reaches half the
 * maximum value
 * @retval None
 */
#define __HAL_ETH_MMC_TX_IT_ENABLE(__HANDLE__, __INTERRUPT__) \
  ((__HANDLE__)->Instance->MMCRIMR &= ~(__INTERRUPT__))

/**
 * @brief  Disables the specified Ethernet MMC Tx interrupts.
 * @param   __HANDLE__: ETH Handle.
 * @param  __INTERRUPT__: specifies the Ethernet MMC interrupt sources to be
 * enabled or disabled. This parameter can be one of the following values:
 *     @arg ETH_MMC_IT_TGF   : When Tx good frame counter reaches half the
 * maximum value
 *     @arg ETH_MMC_IT_TGFMSC: When Tx good multi col counter reaches half the
 * maximum value
 *     @arg ETH_MMC_IT_TGFSC : When Tx good single col counter reaches half the
 * maximum value
 * @retval None
 */
#define __HAL_ETH_MMC_TX_IT_DISABLE(__HANDLE__, __INTERRUPT__) \
  ((__HANDLE__)->Instance->MMCRIMR |= (__INTERRUPT__))

/**
 * @brief  Enables the ETH External interrupt line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_ENABLE_IT() EXTI->IMR |= (ETH_EXTI_LINE_WAKEUP)

/**
 * @brief  Disables the ETH External interrupt line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_DISABLE_IT() EXTI->IMR &= ~(ETH_EXTI_LINE_WAKEUP)

/**
 * @brief Enable event on ETH External event line.
 * @retval None.
 */
#define __HAL_ETH_WAKEUP_EXTI_ENABLE_EVENT() EXTI->EMR |= (ETH_EXTI_LINE_WAKEUP)

/**
 * @brief Disable event on ETH External event line
 * @retval None.
 */
#define __HAL_ETH_WAKEUP_EXTI_DISABLE_EVENT() \
  EXTI->EMR &= ~(ETH_EXTI_LINE_WAKEUP)

/**
 * @brief  Get flag of the ETH External interrupt line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_GET_FLAG() EXTI->PR &(ETH_EXTI_LINE_WAKEUP)

/**
 * @brief  Clear flag of the ETH External interrupt line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_CLEAR_FLAG() EXTI->PR = (ETH_EXTI_LINE_WAKEUP)

/**
 * @brief  Enables rising edge trigger to the ETH External interrupt line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_ENABLE_RISING_EDGE_TRIGGER() \
  EXTI->RTSR |= ETH_EXTI_LINE_WAKEUP

/**
 * @brief  Disables the rising edge trigger to the ETH External interrupt line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_DISABLE_RISING_EDGE_TRIGGER() \
  EXTI->RTSR &= ~(ETH_EXTI_LINE_WAKEUP)

/**
 * @brief  Enables falling edge trigger to the ETH External interrupt line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_ENABLE_FALLING_EDGE_TRIGGER() \
  EXTI->FTSR |= (ETH_EXTI_LINE_WAKEUP)

/**
 * @brief  Disables falling edge trigger to the ETH External interrupt line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_DISABLE_FALLING_EDGE_TRIGGER() \
  EXTI->FTSR &= ~(ETH_EXTI_LINE_WAKEUP)

