cesanta/mongoose/test/freertos-tcp/portable/NetworkInterface/STM32Fxx/stm32fxx_hal_eth.h
/**
 * @brief  Enables rising/falling edge trigger to the ETH External interrupt
 * line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_ENABLE_FALLINGRISING_TRIGGER() \
  EXTI->RTSR |= ETH_EXTI_LINE_WAKEUP;                        \
  EXTI->FTSR |= ETH_EXTI_LINE_WAKEUP

/**
 * @brief  Disables rising/falling edge trigger to the ETH External interrupt
 * line.
 * @retval None
 */
#define __HAL_ETH_WAKEUP_EXTI_DISABLE_FALLINGRISING_TRIGGER() \
  EXTI->RTSR &= ~(ETH_EXTI_LINE_WAKEUP);                      \
  EXTI->FTSR &= ~(ETH_EXTI_LINE_WAKEUP)

/**
 * @brief Generate a Software interrupt on selected EXTI line.
 * @retval None.
 */
#define __HAL_ETH_WAKEUP_EXTI_GENERATE_SWIT() \
  EXTI->SWIER |= ETH_EXTI_LINE_WAKEUP

/**
 * @}
 */
/* Exported functions --------------------------------------------------------*/

/** @addtogroup ETH_Exported_Functions
 * @{
 */

/* Initialization and de-initialization functions  ****************************/

/** @addtogroup ETH_Exported_Functions_Group1
 * @{
 */
HAL_StatusTypeDef HAL_ETH_Init(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETH_DeInit(ETH_HandleTypeDef *heth);
void HAL_ETH_MspInit(ETH_HandleTypeDef *heth);
void HAL_ETH_MspDeInit(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETH_DMATxDescListInit(ETH_HandleTypeDef *heth,
                                            ETH_DMADescTypeDef *DMATxDescTab,
                                            uint8_t *TxBuff,
                                            uint32_t TxBuffCount);
HAL_StatusTypeDef HAL_ETH_DMARxDescListInit(ETH_HandleTypeDef *heth,
                                            ETH_DMADescTypeDef *DMARxDescTab,
                                            uint8_t *RxBuff,
                                            uint32_t RxBuffCount);

/**
 * @}
 */
/* IO operation functions  ****************************************************/

/** @addtogroup ETH_Exported_Functions_Group2
 * @{
 */
HAL_StatusTypeDef HAL_ETH_TransmitFrame(ETH_HandleTypeDef *heth,
                                        uint32_t FrameLength);
HAL_StatusTypeDef HAL_ETH_GetReceivedFrame(ETH_HandleTypeDef *heth);
/* Communication with PHY functions*/
HAL_StatusTypeDef HAL_ETH_ReadPHYRegister(ETH_HandleTypeDef *heth,
                                          uint16_t PHYReg, uint32_t *RegValue);
HAL_StatusTypeDef HAL_ETH_WritePHYRegister(ETH_HandleTypeDef *heth,
                                           uint16_t PHYReg, uint32_t RegValue);
/* Non-Blocking mode: Interrupt */
HAL_StatusTypeDef HAL_ETH_GetReceivedFrame_IT(ETH_HandleTypeDef *heth);
void HAL_ETH_IRQHandler(ETH_HandleTypeDef *heth);
/* Callback in non blocking modes (Interrupt) */
void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth);
void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth);
void HAL_ETH_ErrorCallback(ETH_HandleTypeDef *heth);

/**
 * @}
 */

/* Peripheral Control functions  **********************************************/

/** @addtogroup ETH_Exported_Functions_Group3
 * @{
 */

HAL_StatusTypeDef HAL_ETH_Start(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETH_Stop(ETH_HandleTypeDef *heth);
HAL_StatusTypeDef HAL_ETH_ConfigMAC(ETH_HandleTypeDef *heth,
                                    ETH_MACInitTypeDef *macconf);
HAL_StatusTypeDef HAL_ETH_ConfigDMA(ETH_HandleTypeDef *heth,
                                    ETH_DMAInitTypeDef *dmaconf);

/**
 * @}
 */

/* Peripheral State functions  ************************************************/

/** @addtogroup ETH_Exported_Functions_Group4
 * @{
 */
HAL_ETH_StateTypeDef HAL_ETH_GetState(ETH_HandleTypeDef *heth);

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */

/**
 * @}
 */
#ifdef __cplusplus
}
#endif

#endif /* __STM32Fxx_HAL_ETH_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
